gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/*
 * Copyright (C) 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 *
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 *
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 *
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 *
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 *
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "iox32x1.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATXMEGA32X1_H_INCLUDED
#define _AVR_ATXMEGA32X1_H_INCLUDED

/* Ungrouped common registers */
#define GPIOR0  _SFR_MEM8(0x0000)  /* General Purpose IO Register 0 */
#define GPIOR1  _SFR_MEM8(0x0001)  /* General Purpose IO Register 1 */
#define GPIOR2  _SFR_MEM8(0x0002)  /* General Purpose IO Register 2 */
#define GPIOR3  _SFR_MEM8(0x0003)  /* General Purpose IO Register 3 */

/* Deprecated */
#define GPIO0  _SFR_MEM8(0x0000)  /* General Purpose IO Register 0 */
#define GPIO1  _SFR_MEM8(0x0001)  /* General Purpose IO Register 1 */
#define GPIO2  _SFR_MEM8(0x0002)  /* General Purpose IO Register 2 */
#define GPIO3  _SFR_MEM8(0x0003)  /* General Purpose IO Register 3 */

#define CCP  _SFR_MEM8(0x0034)  /* Configuration Change Protection */
#define SPL  _SFR_MEM8(0x003D)  /* Stack Pointer Low */
#define SPH  _SFR_MEM8(0x003E)  /* Stack Pointer High */
#define SREG  _SFR_MEM8(0x003F)  /* Status Register */

/* C Language Only */
#if !defined (__ASSEMBLER__)

#include <stdint.h>

typedef volatile uint8_t register8_t;
typedef volatile uint16_t register16_t;
typedef volatile uint32_t register32_t;


#ifdef _WORDREGISTER
#undef _WORDREGISTER
#endif
#define _WORDREGISTER(regname)   \
    __extension__ union \
    { \
        register16_t regname; \
        struct \
        { \
            register8_t regname ## L; \
            register8_t regname ## H; \
        }; \
    }

#ifdef _DWORDREGISTER
#undef _DWORDREGISTER
#endif
#define _DWORDREGISTER(regname)  \
    __extension__ union \
    { \
        register32_t regname; \
        struct \
        { \
            register8_t regname ## 0; \
            register8_t regname ## 1; \
            register8_t regname ## 2; \
            register8_t regname ## 3; \
        }; \
    }


/*
==========================================================================
IO Module Structures
==========================================================================
*/


/*
--------------------------------------------------------------------------
BCD - Bus Connect/Disconnect on Communication Lines
--------------------------------------------------------------------------
*/

/* Bus Connect/Disconnect */
typedef struct BCD_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t STATUS;  /* Status Register */
} BCD_t;

/* Mode */
typedef enum BCD_MODE_enum
{
    BCD_MODE_DISABLE_gc = (0x00<<0),  /* Disabled */
    BCD_MODE_TWOWIRE_gc = (0x01<<0),  /* 2-wire mode */
    BCD_MODE_ONEWIRE_gc = (0x02<<0),  /* 1-wire mode% */
} BCD_MODE_t;

/* Timeout */
typedef enum BCD_TIMEOUT_enum
{
    BCD_TIMEOUT_250ms_gc = (0x00<<2),  /* 250ms +-15% */
    BCD_TIMEOUT_500ms_gc = (0x01<<2),  /* 500ms +-15% */
    BCD_TIMEOUT_1000ms_gc = (0x02<<2),  /* 1000ms +-15% */
    BCD_TIMEOUT_2000ms_gc = (0x03<<2),  /* 2000ms +-15% */
} BCD_TIMEOUT_t;

/*
--------------------------------------------------------------------------
CADC - Current ADC
--------------------------------------------------------------------------
*/

/* Current ADC */
typedef struct CADC_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t CTRLC;  /* Control Register C */
    register8_t INTCTRL;  /* Interrupt Control Register */
    register8_t DIAGNOSIS;  /* Diagnosis Register */
    register8_t STATUS;  /* Status Register */
    register8_t PROTECTION;  /* Protection Register */
    _WORDREGISTER(INST);  /* Instantaneous Conversion Result */
    _DWORDREGISTER(ACC);  /* Accumulated Conversion Result */
    register8_t I2INST;  /* I2 Instantaneous Conversion Result */
    _WORDREGISTER(I2ACC);  /* I2 Accumulated Conversion Result */
    _WORDREGISTER(PHTHRES);  /* Protection Window Comparator High Threshold */
    _WORDREGISTER(PLTHRES);  /* Protection Window Comparator Low Threshold */
    _WORDREGISTER(SHTHRES);  /* Sample Mode Window Comparator High Threshold */
    _WORDREGISTER(SLTHRES);  /* Sample Mode Window Comparator Low Threshold */
} CADC_t;

/* Accumulated Decimation Ratio */
typedef enum CADC_ACDEC_enum
{
    CADC_ACDEC_512_gc = (0x00<<0),  /* 512 decimation */
    CADC_ACDEC_256_gc = (0x01<<0),  /* 256 decimation */
    CADC_ACDEC_128_gc = (0x02<<0),  /* 128 decimation */
    CADC_ACDEC_64_gc = (0x03<<0),  /* 64 decimation */
} CADC_ACDEC_t;

/* Clock Select */
typedef enum CADC_CLKS_enum
{
    CADC_CLKS_32000Hz_gc = (0x00<<6),  /* CADC clock set to 32kHz */
    CADC_CLKS_128000Hz_gc = (0x01<<6),  /* CADC clock set to 128kHz */
} CADC_CLKS_t;

