gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* Instantaneous Decimation Ratio */
typedef enum CADC_ICDEC_enum
{
    CADC_ICDEC_256_gc = (0x00<<3),  /* 256 decimation */
    CADC_ICDEC_128_gc = (0x01<<3),  /* 128 decimation */
} CADC_ICDEC_t;

/* Pin Diagnosis Configuration */
typedef enum CADC_PINDM_enum
{
    CADC_PINDM_DIAG_OFF_gc = (0x00<<0),  /* No diagnosis enabled */
    CADC_PINDM_DIAG_PI_gc = (0x01<<0),  /* Pull-up on PI enabled */
    CADC_PINDM_DIAG_NI_gc = (0x02<<0),  /* Pull-up on NI enabled */
    CADC_PINDM_DIAG_PI_NI_gc = (0x03<<0),  /* Pull-up on PI and NI enabled */
} CADC_PINDM_t;

/* CADC Sampling Interval Configuration */
typedef enum CADC_SAI_enum
{
    CADC_SAI_250ms_gc = (0x00<<0),  /* 250ms sampling interval */
    CADC_SAI_500ms_gc = (0x01<<0),  /* 500ms sampling interval */
    CADC_SAI_1s_gc = (0x02<<0),  /* 1s sampling interval */
    CADC_SAI_2s_gc = (0x03<<0),  /* 2s sampling interval */
} CADC_SAI_t;

/*
--------------------------------------------------------------------------
CLK - Clock System
--------------------------------------------------------------------------
*/

/* Clock System */
typedef struct CLK_struct
{
    register8_t CLKPSR;  /* Clock Prescaler Register */
    register8_t CLKSLR;  /* Prescaler Settings Lock Register */
} CLK_t;

/* Clock Prescaler Division Factor  */
typedef enum CLK_CLKPDIV_enum
{
    CLK_CLKPDIV_CLKPS_DIV1_gc = (0x00<<0),  /* No division */
    CLK_CLKPDIV_CLKPS_DIV2_gc = (0x01<<0),  /* Divide system oscillator with 2 */
    CLK_CLKPDIV_CLKPS_DIV4_gc = (0x02<<0),  /* Divide system oscillator with 4 */
    CLK_CLKPDIV_CKLPS_DIV8_gc = (0x03<<0),  /* Divide system oscillator with 8 */
} CLK_CLKPDIV_t;

/*
--------------------------------------------------------------------------
COMTR - Communication Timeout Reset
--------------------------------------------------------------------------
*/

/* Communication Timeout */
typedef struct COMTR_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t STATUS;  /* Status Register */
} COMTR_t;


/*
--------------------------------------------------------------------------
CPROT - DAC-Based Current Protection
--------------------------------------------------------------------------
*/

/* DAC-Based Current Protection */
typedef struct CPROT_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t SCTIMING;  /* Short Circuit Protection Timing Register */
    register8_t OCTIMING;  /* Over Current Protection Timing Register */
    register8_t SCLEVEL;  /* Short Circuit Detection Level Register */
    register8_t COCLEVEL;  /* Charge Over Current Detection Level Register */
    register8_t DOCLEVEL;  /* Discharge Over Current Detection Level Register */
    register8_t OCREG;  /* Offset Correction Register */
} CPROT_t;


/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V3XJ

/* CCP signatures */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CRC - Cyclic Redundancy Checker
--------------------------------------------------------------------------
*/

/* Cyclic Redundancy Checker */
typedef struct CRC_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t STATUS;  /* Status Register */
    register8_t reserved_1[1];
    register8_t DATAIN;  /* Data Input */
    register8_t CHECKSUM0;  /* Checksum byte 0 */
    register8_t CHECKSUM1;  /* Checksum byte 1 */
    register8_t CHECKSUM2;  /* Checksum byte 2 */
    register8_t CHECKSUM3;  /* Checksum byte 3 */
} CRC_t;

/* Reset */
typedef enum CRC_RESET_enum
{
    CRC_RESET_NO_gc = (0x00<<6),  /* No Reset */
    CRC_RESET_RESET0_gc = (0x02<<6),  /* Reset CRC with CHECKSUM to all zeros */
    CRC_RESET_RESET1_gc = (0x03<<6),  /* Reset CRC with CHECKSUM to all ones */
} CRC_RESET_t;

/* Input Source */
typedef enum CRC_SOURCE_enum
{
    CRC_SOURCE_DISABLE_gc = (0x00<<0),  /* Disabled */
    CRC_SOURCE_IO_gc = (0x01<<0),  /* I/O Interface */
    CRC_SOURCE_FLASH_gc = (0x02<<0),  /* Flash */
} CRC_SOURCE_t;

/*
--------------------------------------------------------------------------
FET - FET controller
--------------------------------------------------------------------------
*/

/* FET controller */
typedef struct FET_struct
{
    register8_t CTRLA;  /* FET Control Register A */
    register8_t CTRLB;  /* FET Control Register B */
    register8_t reserved_1[2];
    register8_t FETACTIONA;  /* FET Event Action Register A */
    register8_t reserved_2[3];
    register8_t FETACTIONE;  /* FET Event Action Register E */
    register8_t FETACTIONF;  /* FET Event Action Register F */
    register8_t FETACTIONG;  /* FET Event Action Register G */
    register8_t reserved_3[5];
    register8_t INTCTRL;  /* Interrupt Control Register  */
    register8_t reserved_4[1];
    register8_t INTMASKA;  /* Interrupt Mask Register A */
    register8_t reserved_5[1];
    register8_t INTMASKC;  /* Protection Interrupt Control Register C */
    register8_t INTMASKD;  /* Interrupt Mask Register D */
    register8_t reserved_6[2];
    register8_t STATUSA;  /* Protection Status Register A */
    register8_t reserved_7[1];
    register8_t STATUSC;  /* Protection Status Register B */
    register8_t STATUSD;  /* Protection Status Register B */
    register8_t reserved_8[3];
    register8_t FETACTIONN;  /* FET Event Action Register N */
} FET_t;

/*  */
typedef enum FET_HIFREQ_enum
{
    FET_HIFREQ_1MHZ_gc = (0x00<<4),  /* 1 MHz */
    FET_HIFREQ_2MHZ_gc = (0x01<<4),  /* 2 MHz */
    FET_HIFREQ_4MHZ_gc = (0x02<<4),  /* 4 MHz */
    FET_HIFREQ_8MHZ_gc = (0x03<<4),  /* 8 MHz */
} FET_HIFREQ_t;

/*  */
typedef enum FET_HIFREQTIME_enum
{
    FET_HIFREQTIME_MIN0MS8_MAX1MS0_gc = (0x00<<0),  /* Min 0.8 ms, max 1.0 ms */
    FET_HIFREQTIME_MIN1MS5_MAX2MS0_gc = (0x01<<0),  /* Min 1.5 ms, max 2.0 ms */
    FET_HIFREQTIME_MIN3MS1_MAX4MS1_gc = (0x02<<0),  /* Min 3.1 ms, max 4.1 ms */
    FET_HIFREQTIME_MIN6MS1_MAX8MS2_gc = (0x03<<0),  /* Min 6.1 ms, max 8.2 ms */
    FET_HIFREQTIME_MIN12MS_MAX16MS_gc = (0x04<<0),  /* Min 12 ms, max 16 ms */
    FET_HIFREQTIME_MIN25MS_MAX33MS_gc = (0x05<<0),  /* Min 25 ms, max 33 ms */
    FET_HIFREQTIME_MIN49MS_MAX66MS_gc = (0x06<<0),  /* Min 49 ms, max 66 ms */
    FET_HIFREQTIME_0MS_gc = (0x07<<0),  /* 0 ms */
} FET_HIFREQTIME_t;

