gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/*
--------------------------------------------------------------------------
FUSE - Fuses and Lockbits
--------------------------------------------------------------------------
*/

/* Fuses */
typedef struct NVM_FUSES_struct
{
    register8_t FUSEBYTE0;  /* NVM Fuse */
    register8_t FUSEBYTE1;  /* Watchdog Configuration */
    register8_t FUSEBYTE2;  /* Reset Configuration */
    register8_t reserved_1[1];
    register8_t FUSEBYTE4;  /* Start-up Configuration */
    register8_t FUSEBYTE5;  /* Non-Volatile Memory Fuse Byte 5 */
} NVM_FUSES_t;

/* Autoload Configuration */
typedef enum AUTOLD_enum
{
    AUTOLD_BOOTSEL_gc = (0x00<<5),  /* Use Boot For User Configuration */
    AUTOLD_APPSEL_gc = (0x01<<5),  /* Use Application For User Configuration */
} AUTOLD_t;

/* Boot Loader Section Reset Vector */
typedef enum BOOTRST_enum
{
    BOOTRST_BOOTLDR_gc = (0x00<<6),  /* Boot Loader Reset */
    BOOTRST_APPLICATION_gc = (0x01<<6),  /* Application Reset */
} BOOTRST_t;

/* Start-up Time */
typedef enum STARTUPTIME_enum
{
    STARTUPTIME_512MS_gc = (0x00<<2),  /* 512 ms */
    STARTUPTIME_64MS_gc = (0x01<<2),  /* 64 ms */
    STARTUPTIME_4MS_gc = (0x02<<2),  /* 4 ms */
} STARTUPTIME_t;

/* Watchdog (Window) Timeout Period */
typedef enum WDPER_enum
{
    WDPER_8CLK_gc = (0x00<<0),  /* 8 cycles (8ms ) */
    WDPER_16CLK_gc = (0x01<<0),  /* 16 cycles (16ms ) */
    WDPER_32CLK_gc = (0x02<<0),  /* 32 cycles (32ms ) */
    WDPER_64CLK_gc = (0x03<<0),  /* 64 cycles (64ms ) */
    WDPER_128CLK_gc = (0x04<<0),  /* 128 cycles (0.125s ) */
    WDPER_256CLK_gc = (0x05<<0),  /* 256 cycles (0.25s ) */
    WDPER_512CLK_gc = (0x06<<0),  /* 512 cycles (0.5s ) */
    WDPER_1KCLK_gc = (0x07<<0),  /* 1K cycles (1s ) */
    WDPER_2KCLK_gc = (0x08<<0),  /* 2K cycles (2s ) */
    WDPER_4KCLK_gc = (0x09<<0),  /* 4K cycles (4s ) */
    WDPER_8KCLK_gc = (0x0A<<0),  /* 8K cycles (8s ) */
} WDPER_t;

/* Watchdog (Window) Timeout Period */
typedef enum WDWPER_enum
{
    WDWPER_8CLK_gc = (0x00<<4),  /* 8 cycles (8ms ) */
    WDWPER_16CLK_gc = (0x01<<4),  /* 16 cycles (16ms ) */
    WDWPER_32CLK_gc = (0x02<<4),  /* 32 cycles (32ms ) */
    WDWPER_64CLK_gc = (0x03<<4),  /* 64 cycles (64ms ) */
    WDWPER_128CLK_gc = (0x04<<4),  /* 128 cycles (0.125s ) */
    WDWPER_256CLK_gc = (0x05<<4),  /* 256 cycles (0.25s ) */
    WDWPER_512CLK_gc = (0x06<<4),  /* 512 cycles (0.5s ) */
    WDWPER_1KCLK_gc = (0x07<<4),  /* 1K cycles (1s ) */
    WDWPER_2KCLK_gc = (0x08<<4),  /* 2K cycles (2s ) */
    WDWPER_4KCLK_gc = (0x09<<4),  /* 4K cycles (4s ) */
    WDWPER_8KCLK_gc = (0x0A<<4),  /* 8K cycles (8s ) */
} WDWPER_t;

/*
--------------------------------------------------------------------------
LOCKBIT - Fuses and Lockbits
--------------------------------------------------------------------------
*/

/* Lock Bits */
typedef struct NVM_LOCKBITS_struct
{
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_LOCKBITS_t;

/* Boot lock bits - application section */
typedef enum BLBA_enum
{
    BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} BLBA_t;

/* Boot lock bits - application table section */
typedef enum BLBAT_enum
{
    BLBAT_RWLOCK_gc = (0x00<<2),  /* Read and write not allowed */
    BLBAT_RLOCK_gc = (0x01<<2),  /* Read not allowed */
    BLBAT_WLOCK_gc = (0x02<<2),  /* Write not allowed */
    BLBAT_NOLOCK_gc = (0x03<<2),  /* No locks */
} BLBAT_t;

/* Boot lock bits - boot section */
typedef enum BLBB_enum
{
    BLBB_RWLOCK_gc = (0x00<<6),  /* Read and write not allowed */
    BLBB_RLOCK_gc = (0x01<<6),  /* Read not allowed */
    BLBB_WLOCK_gc = (0x02<<6),  /* Write not allowed */
    BLBB_NOLOCK_gc = (0x03<<6),  /* No locks */
} BLBB_t;

/* Lock bits */
typedef enum LB_enum
{
    LB_RWLOCK_gc = (0x00<<0),  /* Read and write not allowed */
    LB_WLOCK_gc = (0x02<<0),  /* Write not allowed */
    LB_NOLOCK_gc = (0x03<<0),  /* No locks */
} LB_t;

/*
--------------------------------------------------------------------------
MCU - MCU Control
--------------------------------------------------------------------------
*/

/* MCU Control */
typedef struct MCU_struct
{
    register8_t DEVID0;  /* Device ID byte 0 */
    register8_t DEVID1;  /* Device ID byte 1 */
    register8_t DEVID2;  /* Device ID byte 2 */
    register8_t REVID;  /* Revision ID */
} MCU_t;


/*
--------------------------------------------------------------------------
NVM - Non Volatile Memory Controller
--------------------------------------------------------------------------
*/

/* Non-volatile Memory Controller */
typedef struct NVM_struct
{
    register8_t ADDR0;  /* Address Register 0 */
    register8_t ADDR1;  /* Address Register 1 */
    register8_t ADDR2;  /* Address Register 2 */
    register8_t reserved_1[1];
    register8_t DATA0;  /* Data Register 0 */
    register8_t DATA1;  /* Data Register 1 */
    register8_t DATA2;  /* Data Register 2 */
    register8_t reserved_2[3];
    register8_t CMD;  /* Command */
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t reserved_3[1];
    register8_t STATUS;  /* Status */
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_t;

/* Boot lock bits - application section */
typedef enum NVM_BLBA_enum
{
    NVM_BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    NVM_BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    NVM_BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    NVM_BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} NVM_BLBA_t;

/* Boot lock bits - application table section */
typedef enum NVM_BLBAT_enum
{
    NVM_BLBAT_RWLOCK_gc = (0x00<<2),  /* Read and write not allowed */
    NVM_BLBAT_RLOCK_gc = (0x01<<2),  /* Read not allowed */
    NVM_BLBAT_WLOCK_gc = (0x02<<2),  /* Write not allowed */
    NVM_BLBAT_NOLOCK_gc = (0x03<<2),  /* No locks */
} NVM_BLBAT_t;

