gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/*
--------------------------------------------------------------------------
PWR - PWR Controller
--------------------------------------------------------------------------
*/

/* PWR Controller */
typedef struct PWR_struct
{
    register8_t STATUS;  /* Status Register */
    register8_t CTRL;  /* Control Register */
} PWR_t;


/*
--------------------------------------------------------------------------
RST - Reset
--------------------------------------------------------------------------
*/

/* Reset */
typedef struct RST_struct
{
    register8_t STATUS;  /* Status Register */
    register8_t CTRL;  /* Control Register */
} RST_t;


/*
--------------------------------------------------------------------------
SIGROW - Signature Row
--------------------------------------------------------------------------
*/

/* Production Signatures */
typedef struct NVM_PROD_SIGNATURES_struct
{
    register8_t reserved_1[8];
    register8_t LOTNUM0;  /* Lot Number Byte 0, ASCII */
    register8_t LOTNUM1;  /* Lot Number Byte 1, ASCII */
    register8_t LOTNUM2;  /* Lot Number Byte 2, ASCII */
    register8_t LOTNUM3;  /* Lot Number Byte 3, ASCII */
    register8_t LOTNUM4;  /* Lot Number Byte 4, ASCII */
    register8_t LOTNUM5;  /* Lot Number Byte 5, ASCII */
    register8_t reserved_2[2];
    register8_t WAFNUM;  /* Wafer Number */
    register8_t reserved_3[1];
    register8_t COORDX0;  /* Wafer Coordinate X Byte 0 */
    register8_t COORDX1;  /* Wafer Coordinate X Byte 1 */
    register8_t COORDY0;  /* Wafer Coordinate Y Byte 0 */
    register8_t COORDY1;  /* Wafer Coordinate Y Byte 1 */
    register8_t VADCOFFCELL0;  /* VADC OFFSET CELL0 */
    register8_t VADCOFFADC0;  /* VADC OFFSET ADC0 */
    register8_t VADCOFFADC1;  /* VADC OFFSET ADC1 */
    register8_t VADCOFFBATT;  /* VADC OFFSET BATT */
    register8_t VADCGAINCELL0H;  /* VADC GAIN CELL0 High Byte */
    register8_t VADCGAINCELL0L;  /* VADC GAIN CELL0 Low Byte */
    register8_t VADCGAINADC0H;  /* VADC GAIN ADC0 High Byte */
    register8_t VADCGAINADC0L;  /* VADC GAIN ADC0 Low Byte */
    register8_t VADCGAINADC1H;  /* VADC GAIN ADC1 High Byte */
    register8_t VADCGAINADC1L;  /* VADC GAIN ADC1 Low Byte */
    register8_t VADCGAINBATTH;  /* VADC GAIN BATT High Byte */
    register8_t VADCGAINBATTL;  /* VADC GAIN BATT Low Byte */
    register8_t VADCCALVTEMPH;  /* VADC GAIN BATT High Byte */
    register8_t VADCCALVTEMPL;  /* VADC CALIBRATION VTEMP Low Byte */
    register8_t reserved_4[218];
    register8_t CRCMASKL;  /* CRC Mask Low byte */
    register8_t CRCMASKH;  /* CRC Mask High byte */
} NVM_PROD_SIGNATURES_t;


/*
--------------------------------------------------------------------------
SLEEP - Sleep Controller
--------------------------------------------------------------------------
*/

/* Sleep Controller */
typedef struct SLEEP_struct
{
    register8_t CTRL;  /* Control Register */
} SLEEP_t;

/* Sleep Mode */
typedef enum SLEEP_SMODE_enum
{
    SLEEP_SMODE_IDLE_gc = (0x00<<1),  /* Idle mode */
    SLEEP_SMODE_PSAVE_gc = (0x01<<1),  /* Power-save Mode */
    SLEEP_SMODE_PDOWN_gc = (0x02<<1),  /* Power-down Mode */
    SLEEP_SMODE_POFF_gc = (0x03<<1),  /* Power-off Mode */
} SLEEP_SMODE_t;

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_PWR_SAVE (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_OFF (0x03<<1)
/*
--------------------------------------------------------------------------
TIM8_16 - Timer 8/16 bit
--------------------------------------------------------------------------
*/

/* Timer 8/16 bit */
typedef struct TIM8_16_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTMSK;  /* Interrupt Mask Register */
    register8_t STATUS;  /* Status Register */
    register8_t TEMP;  /* Temporary Register */
    register8_t reserved_1[3];
    register8_t COUNTL;  /* Count Register Low Byte */
    register8_t COUNTH;  /* Count Register High Byte */
    register8_t OCRA;  /* Output Compare Register A */
    register8_t OCRB;  /* Output Compare Register B */
    register8_t reserved_2[4];
} TIM8_16_t;

/* Clock Select */
typedef enum TIM8_16_CS_enum
{
    TIM8_16_CS_STOPPED_gc = (0x00<<0),  /* No clock selected */
    TIM8_16_CS_CLKIO_gc = (0x01<<0),  /* clkIO - No prescaling */
    TIM8_16_CS_CLKIO_DIV8_gc = (0x02<<0),  /* clkIO/8 from prescaling */
    TIM8_16_CS_CLKIO_DIV64_gc = (0x03<<0),  /* clkIO/64 from prescaling */
    TIM8_16_CS_CLKIO_DIV256_gc = (0x04<<0),  /* clkIO/256 from prescaling */
    TIM8_16_CS_CLKIO_DIV1024_gc = (0x05<<0),  /* clkIO/1024 from prescaling */
    TIM8_16_CS_7U6_gc = (0x06<<0),  /* 7.6us clock selected */
    TIM8_16_CS_15U_gc = (0x07<<0),  /* 15us clock selected */
    TIM8_16_CS_61U_gc = (0x08<<0),  /* 61us clock selected */
    TIM8_16_CS_244U_gc = (0x09<<0),  /* 244us clock selected */
    TIM8_16_CS_1M0_gc = (0x0A<<0),  /* 1ms clock selected */
    TIM8_16_CS_3M9_gc = (0x0B<<0),  /* 3.9ms clock selected */
    TIM8_16_CS_15M6_gc = (0x0C<<0),  /* 15.6ms clock selected */
    TIM8_16_CS_62M5_gc = (0x0D<<0),  /* 62.5ms clock selected */
    TIM8_16_CS_250M_gc = (0x0E<<0),  /* 250ms clock selected */
    TIM8_16_CS_1S_gc = (0x0F<<0),  /* 1s clock selected */
} TIM8_16_CS_t;

/* Input Capture Select */
typedef enum TIM8_16_ICS_enum
{
    TIM8_16_ICS_PC0_gc = (0x00<<4),  /* Input capture source = PC0 */
    TIM8_16_ICS_PC1_gc = (0x01<<4),  /* Input capture source = PC1 */
    TIM8_16_ICS_PA0_gc = (0x02<<4),  /* Input capture source = PA0 */
} TIM8_16_ICS_t;

/*
--------------------------------------------------------------------------
TIMPRESC - Timer Prescaler
--------------------------------------------------------------------------
*/

/* Timer Prescaler */
typedef struct TIMPRESC_struct
{
    register8_t PRESC;  /* Prescaler Register */
} TIMPRESC_t;


/*
--------------------------------------------------------------------------
TWI - Two-Wire Interface
--------------------------------------------------------------------------
*/

typedef struct TWI_SLAVE_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t STATUS;  /* Status Register */
    register8_t ADDR;  /* Address Register */
    register8_t DATA;  /* Data Register */
    register8_t ADDRMASK;  /* Address Mask Register */
} TWI_SLAVE_t;


/* Two-Wire Interface */
typedef struct TWI_struct
{
    register8_t CTRL;  /* TWI Common Control Register */
    register8_t reserved_1[7];
    TWI_SLAVE_t SLAVE;  /* TWI slave module */
} TWI_t;

/* Slave Command */
typedef enum TWI_SLAVE_CMD_enum
{
    TWI_SLAVE_CMD_NOACT_gc = (0x00<<0),  /* No Action */
    TWI_SLAVE_CMD_COMPTRANS_gc = (0x02<<0),  /* Used To Complete a Transaction */
    TWI_SLAVE_CMD_RESPONSE_gc = (0x03<<0),  /* Used in Response to Address/Data Interrupt */
} TWI_SLAVE_CMD_t;

/* Slave Interrupt Level */
typedef enum TWI_SLAVE_INTLVL_enum
{
    TWI_SLAVE_INTLVL_OFF_gc = (0x00<<6),  /* Interrupt Disabled */
    TWI_SLAVE_INTLVL_LO_gc = (0x01<<6),  /* Low Level */
    TWI_SLAVE_INTLVL_MED_gc = (0x02<<6),  /* Medium Level */
    TWI_SLAVE_INTLVL_HI_gc = (0x03<<6),  /* High Level */
} TWI_SLAVE_INTLVL_t;

