gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/*
--------------------------------------------------------------------------
USART - Universal Asynchronous Receiver-Transmitter
--------------------------------------------------------------------------
*/

/* Universal Synchronous/Asynchronous Receiver/Transmitter */
typedef struct USART_struct
{
    register8_t DATA;  /* Data Register */
    register8_t STATUS;  /* Status Register */
    register8_t CTRLD;  /* Control Register D */
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t CTRLC;  /* Control Register C */
    register8_t BAUDCTRLA;  /* Baud Rate Control Register A */
    register8_t BAUDCTRLB;  /* Baud Rate Control Register B */
} USART_t;

/* Character Size */
typedef enum USART_CHSIZE_enum
{
    USART_CHSIZE_5BIT_gc = (0x00<<0),  /* Character size: 5 bit */
    USART_CHSIZE_6BIT_gc = (0x01<<0),  /* Character size: 6 bit */
    USART_CHSIZE_7BIT_gc = (0x02<<0),  /* Character size: 7 bit */
    USART_CHSIZE_8BIT_gc = (0x03<<0),  /* Character size: 8 bit */
    USART_CHSIZE_9BIT_gc = (0x07<<0),  /* Character size: 9 bit */
} USART_CHSIZE_t;

/* Communication Mode */
typedef enum USART_CMODE_enum
{
    USART_CMODE_ASYNCHRONOUS_gc = (0x00<<6),  /* Asynchronous Mode */
} USART_CMODE_t;

/* Data Register Empty Interrupt level */
typedef enum USART_DREINTLVL_enum
{
    USART_DREINTLVL_OFF_gc = (0x00<<0),  /* Interrupt Disabled */
    USART_DREINTLVL_LO_gc = (0x01<<0),  /* Low Level */
    USART_DREINTLVL_MED_gc = (0x02<<0),  /* Medium Level */
    USART_DREINTLVL_HI_gc = (0x03<<0),  /* High Level */
} USART_DREINTLVL_t;

/* Parity Mode */
typedef enum USART_PMODE_enum
{
    USART_PMODE_DISABLED_gc = (0x00<<4),  /* No Parity */
    USART_PMODE_EVEN_gc = (0x02<<4),  /* Even Parity */
    USART_PMODE_ODD_gc = (0x03<<4),  /* Odd Parity */
} USART_PMODE_t;

/* Receive Complete Interrupt level */
typedef enum USART_RXCINTLVL_enum
{
    USART_RXCINTLVL_OFF_gc = (0x00<<4),  /* Interrupt Disabled */
    USART_RXCINTLVL_LO_gc = (0x01<<4),  /* Low Level */
    USART_RXCINTLVL_MED_gc = (0x02<<4),  /* Medium Level */
    USART_RXCINTLVL_HI_gc = (0x03<<4),  /* High Level */
} USART_RXCINTLVL_t;

/* Stop Bit Mode */
typedef enum USART_SBMODE_enum
{
    USART_SBMODE_1BIT_gc = (0x00<<3),  /* Stop bit is 1-bit */
    USART_SBMODE_2BIT_gc = (0x01<<3),  /* 2-bits Stop bit */
} USART_SBMODE_t;

/* Transmit Complete Interrupt level */
typedef enum USART_TXCINTLVL_enum
{
    USART_TXCINTLVL_OFF_gc = (0x00<<2),  /* Interrupt Disabled */
    USART_TXCINTLVL_LO_gc = (0x01<<2),  /* Low Level */
    USART_TXCINTLVL_MED_gc = (0x02<<2),  /* Medium Level */
    USART_TXCINTLVL_HI_gc = (0x03<<2),  /* High Level */
} USART_TXCINTLVL_t;

/*
--------------------------------------------------------------------------
VADC - Voltage ADC
--------------------------------------------------------------------------
*/

/* Voltage ADC */
typedef struct VADC_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t DIAGNOSIS;  /* Diagnosis Register */
    register8_t SCANSETUP;  /* Scan Setup Register */
    register8_t PROTSETUPA;  /* Protection Register A */
    register8_t PROTSETUPB;  /* Protection Register B */
    register8_t STATUS;  /* Status Register */
    register8_t reserved_1[9];
    _WORDREGISTER(BATTRES);  /* BATT-GND Conversion Result */
    _WORDREGISTER(VTEMPRES);  /* VTEMP-GND Conversion Result */
    _WORDREGISTER(ADC0RES);  /* ADC0-SGND Conversion Result */
    _WORDREGISTER(ADC1RES);  /* ADC1-SGND Conversion Result */
    _WORDREGISTER(PVNVRES);  /* PV-NV Conversion Result */
    register8_t reserved_2[38];
    _WORDREGISTER(VTEMPTH);  /* Internal Temperature Sensor High Threshold Level */
    _WORDREGISTER(VTEMPTL);  /* Internal Temperature Sensor Low Threshold Level */
    _WORDREGISTER(ADC0HT);  /* ADC0-SGND High Threshold Level */
    _WORDREGISTER(ADC0LT);  /* ADC0-SGND Low Threshold Level */
    _WORDREGISTER(ADC1HT);  /* ADC1-SGND High Threshold Level */
    _WORDREGISTER(ADC1LT);  /* ADC1-SGND Low Threshold Level */
    _WORDREGISTER(PVNVHT);  /* PV-NV High Threshold Level */
    _WORDREGISTER(PVNVLT);  /* PV-NV Low Threshold Level */
} VADC_t;

/* Decimation Ratio */
typedef enum VADC_DECIR_enum
{
    VADC_DECIR_DECIR_512x_gc = (0x00<<0),  /* 512x decimation */
    VADC_DECIR_DECIR_256x_gc = (0x01<<0),  /* 256x decimation */
    VADC_DECIR_DECIR_128x_gc = (0x02<<0),  /* 128x decimation */
} VADC_DECIR_t;

/* NV Diagnosis Configuration */
typedef enum VADC_NVDIAG_enum
{
    VADC_NVDIAG_NVDIAG_OFF_gc = (0x00<<0),  /* No diagnosis enabled */
    VADC_NVDIAG_NVDIAG_PU_gc = (0x02<<0),  /* Pull-up enabled */
} VADC_NVDIAG_t;

/* Protection Count Limit */
typedef enum VADC_PROTCNT_enum
{
    VADC_PROTCNT_1_gc = (0x00<<5),  /* 1 violation triggers protection */
    VADC_PROTCNT_2_gc = (0x01<<5),  /* 2 violation triggers protection */
    VADC_PROTCNT_3_gc = (0x02<<5),  /* 3 violation triggers protection */
    VADC_PROTCNT_4_gc = (0x03<<5),  /* 4 violation triggers protection */
} VADC_PROTCNT_t;

/* PV Diagnosis Configuration */
typedef enum VADC_PVDIAG_enum
{
    VADC_PVDIAG_PVDIAG_OFF_gc = (0x00<<2),  /* No diagnosis enabled */
    VADC_PVDIAG_PVDIAG_PD_gc = (0x01<<2),  /* Pull down enabled */
} VADC_PVDIAG_t;

/* Protection scan period */
typedef enum VADC_TIMING_enum
{
    VADC_TIMING_125MS_gc = (0x00<<0),  /* Protection scan interval 125ms */
    VADC_TIMING_250MS_gc = (0x01<<0),  /* Protection scan interval 250ms */
    VADC_TIMING_500MS_gc = (0x02<<0),  /* Protection scan interval 500ms */
    VADC_TIMING_1S_gc = (0x03<<0),  /* Protection scan interval 1s */
    VADC_TIMING_2S_gc = (0x04<<0),  /* Protection scan interval 2s */
} VADC_TIMING_t;

/*
--------------------------------------------------------------------------
VPORT - Virtual Ports
--------------------------------------------------------------------------
*/

/* Virtual Port */
typedef struct VPORT_struct
{
    register8_t DIR;  /* I/O Port Data Direction */
    register8_t OUT;  /* I/O Port Output */
    register8_t IN;  /* I/O Port Input */
    register8_t INTFLAGS;  /* Interrupt Flag Register */
    register8_t reserved_1[12];
} VPORT_t;


