gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* Deprecated */
#define GPIO_GPIO0  _SFR_MEM8(0x0000)
#define GPIO_GPIO1  _SFR_MEM8(0x0001)
#define GPIO_GPIO2  _SFR_MEM8(0x0002)
#define GPIO_GPIO3  _SFR_MEM8(0x0003)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE0  _SFR_MEM8(0x0000)
#define FUSE_FUSEBYTE1  _SFR_MEM8(0x0001)
#define FUSE_FUSEBYTE2  _SFR_MEM8(0x0002)
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)


/* NVM_LOCKBITS (LOCKBIT) - Lock Bits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_LOTNUM0  _SFR_MEM8(0x0008)
#define PRODSIGNATURES_LOTNUM1  _SFR_MEM8(0x0009)
#define PRODSIGNATURES_LOTNUM2  _SFR_MEM8(0x000A)
#define PRODSIGNATURES_LOTNUM3  _SFR_MEM8(0x000B)
#define PRODSIGNATURES_LOTNUM4  _SFR_MEM8(0x000C)
#define PRODSIGNATURES_LOTNUM5  _SFR_MEM8(0x000D)
#define PRODSIGNATURES_WAFNUM  _SFR_MEM8(0x0010)
#define PRODSIGNATURES_COORDX0  _SFR_MEM8(0x0012)
#define PRODSIGNATURES_COORDX1  _SFR_MEM8(0x0013)
#define PRODSIGNATURES_COORDY0  _SFR_MEM8(0x0014)
#define PRODSIGNATURES_COORDY1  _SFR_MEM8(0x0015)
#define PRODSIGNATURES_VADCOFFCELL0  _SFR_MEM8(0x0016)
#define PRODSIGNATURES_VADCOFFADC0  _SFR_MEM8(0x0017)
#define PRODSIGNATURES_VADCOFFADC1  _SFR_MEM8(0x0018)
#define PRODSIGNATURES_VADCOFFBATT  _SFR_MEM8(0x0019)
#define PRODSIGNATURES_VADCGAINCELL0H  _SFR_MEM8(0x001A)
#define PRODSIGNATURES_VADCGAINCELL0L  _SFR_MEM8(0x001B)
#define PRODSIGNATURES_VADCGAINADC0H  _SFR_MEM8(0x001C)
#define PRODSIGNATURES_VADCGAINADC0L  _SFR_MEM8(0x001D)
#define PRODSIGNATURES_VADCGAINADC1H  _SFR_MEM8(0x001E)
#define PRODSIGNATURES_VADCGAINADC1L  _SFR_MEM8(0x001F)
#define PRODSIGNATURES_VADCGAINBATTH  _SFR_MEM8(0x0020)
#define PRODSIGNATURES_VADCGAINBATTL  _SFR_MEM8(0x0021)
#define PRODSIGNATURES_VADCCALVTEMPH  _SFR_MEM8(0x0022)
#define PRODSIGNATURES_VADCCALVTEMPL  _SFR_MEM8(0x0023)
#define PRODSIGNATURES_CRCMASKL  _SFR_MEM8(0x00FE)
#define PRODSIGNATURES_CRCMASKH  _SFR_MEM8(0x00FF)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


/* VPORT (VPORT1) - Virtual Port */
#define VPORT1_DIR  _SFR_MEM8(0x0014)
#define VPORT1_OUT  _SFR_MEM8(0x0015)
#define VPORT1_IN  _SFR_MEM8(0x0016)
#define VPORT1_INTFLAGS  _SFR_MEM8(0x0017)


/* VPORT (VPORT2) - Virtual Port */
#define VPORT2_DIR  _SFR_MEM8(0x0018)
#define VPORT2_OUT  _SFR_MEM8(0x0019)
#define VPORT2_IN  _SFR_MEM8(0x001A)
#define VPORT2_INTFLAGS  _SFR_MEM8(0x001B)


/* VPORT (VPORT3) - Virtual Port */
#define VPORT3_DIR  _SFR_MEM8(0x001C)
#define VPORT3_OUT  _SFR_MEM8(0x001D)
#define VPORT3_IN  _SFR_MEM8(0x001E)
#define VPORT3_INTFLAGS  _SFR_MEM8(0x001F)


/* OCD - On-Chip Debug System */
#define OCD_OCDR0  _SFR_MEM8(0x002E)
#define OCD_OCDR1  _SFR_MEM8(0x002F)


/* CPU - CPU registers */
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* SLEEP - Sleep Controller */
#define SLEEP_CTRL  _SFR_MEM8(0x0040)


/* PWR - PWR Controller */
#define PWR_STATUS  _SFR_MEM8(0x0042)
#define PWR_CTRL  _SFR_MEM8(0x0043)


/* RST - Reset */
#define RST_STATUS  _SFR_MEM8(0x0044)
#define RST_CTRL  _SFR_MEM8(0x0045)


/* CLK - Clock System */
#define CLK_CLKPSR  _SFR_MEM8(0x0048)
#define CLK_CLKSLR  _SFR_MEM8(0x0049)


/* NVM - Non-volatile Memory Controller */
#define NVM_ADDR0  _SFR_MEM8(0x0060)
#define NVM_ADDR1  _SFR_MEM8(0x0061)
#define NVM_ADDR2  _SFR_MEM8(0x0062)
#define NVM_DATA0  _SFR_MEM8(0x0064)
#define NVM_DATA1  _SFR_MEM8(0x0065)
#define NVM_DATA2  _SFR_MEM8(0x0066)
#define NVM_CMD  _SFR_MEM8(0x006A)
#define NVM_CTRLA  _SFR_MEM8(0x006B)
#define NVM_CTRLB  _SFR_MEM8(0x006C)
#define NVM_INTCTRL  _SFR_MEM8(0x006D)
#define NVM_STATUS  _SFR_MEM8(0x006F)
#define NVM_LOCKBITS  _SFR_MEM8(0x0070)


/* WDT - Watch-Dog Timer */
#define WDT_CTRL  _SFR_MEM8(0x0080)
#define WDT_WINCTRL  _SFR_MEM8(0x0081)
#define WDT_STATUS  _SFR_MEM8(0x0082)


/* MCU - MCU Control */
#define MCU_DEVID0  _SFR_MEM8(0x0090)
#define MCU_DEVID1  _SFR_MEM8(0x0091)
#define MCU_DEVID2  _SFR_MEM8(0x0092)
#define MCU_REVID  _SFR_MEM8(0x0093)


/* PMIC - Programmable Multi-level Interrupt Controller */
#define PMIC_STATUS  _SFR_MEM8(0x00A0)
#define PMIC_INTPRI  _SFR_MEM8(0x00A1)
#define PMIC_CTRL  _SFR_MEM8(0x00A2)


/* CRC - Cyclic Redundancy Checker */
#define CRC_CTRL  _SFR_MEM8(0x00B0)
#define CRC_STATUS  _SFR_MEM8(0x00B1)
#define CRC_DATAIN  _SFR_MEM8(0x00B3)
#define CRC_CHECKSUM0  _SFR_MEM8(0x00B4)
#define CRC_CHECKSUM1  _SFR_MEM8(0x00B5)
#define CRC_CHECKSUM2  _SFR_MEM8(0x00B6)
#define CRC_CHECKSUM3  _SFR_MEM8(0x00B7)


/* WUT - Wake-up Timer */
#define WUT_CTRL  _SFR_MEM8(0x00C0)
#define WUT_INTCTRL  _SFR_MEM8(0x00C1)
#define WUT_STATUS  _SFR_MEM8(0x00C2)


/* VADC - Voltage ADC */
#define VADC_CTRLA  _SFR_MEM8(0x0200)
#define VADC_CTRLB  _SFR_MEM8(0x0201)
#define VADC_DIAGNOSIS  _SFR_MEM8(0x0202)
#define VADC_SCANSETUP  _SFR_MEM8(0x0203)
#define VADC_PROTSETUPA  _SFR_MEM8(0x0204)
#define VADC_PROTSETUPB  _SFR_MEM8(0x0205)
#define VADC_STATUS  _SFR_MEM8(0x0206)
#define VADC_BATTRES  _SFR_MEM16(0x0210)
#define VADC_BATTRESL  _SFR_MEM8(0x0210)
#define VADC_BATTRESH  _SFR_MEM8(0x0211)
#define VADC_VTEMPRES  _SFR_MEM16(0x0212)
#define VADC_VTEMPRESL  _SFR_MEM8(0x0212)
#define VADC_VTEMPRESH  _SFR_MEM8(0x0213)
#define VADC_ADC0RES  _SFR_MEM16(0x0214)
#define VADC_ADC0RESL  _SFR_MEM8(0x0214)
#define VADC_ADC0RESH  _SFR_MEM8(0x0215)
#define VADC_ADC1RES  _SFR_MEM16(0x0216)
#define VADC_ADC1RESL  _SFR_MEM8(0x0216)
#define VADC_ADC1RESH  _SFR_MEM8(0x0217)
#define VADC_PVNVRES  _SFR_MEM16(0x0218)
#define VADC_PVNVRESL  _SFR_MEM8(0x0218)
#define VADC_PVNVRESH  _SFR_MEM8(0x0219)
#define VADC_VTEMPTH  _SFR_MEM16(0x0240)
#define VADC_VTEMPTHL  _SFR_MEM8(0x0240)
#define VADC_VTEMPTHH  _SFR_MEM8(0x0241)
#define VADC_VTEMPTL  _SFR_MEM16(0x0242)
#define VADC_VTEMPTLL  _SFR_MEM8(0x0242)
#define VADC_VTEMPTLH  _SFR_MEM8(0x0243)
#define VADC_ADC0HT  _SFR_MEM16(0x0244)
#define VADC_ADC0HTL  _SFR_MEM8(0x0244)
#define VADC_ADC0HTH  _SFR_MEM8(0x0245)
#define VADC_ADC0LT  _SFR_MEM16(0x0246)
#define VADC_ADC0LTL  _SFR_MEM8(0x0246)
#define VADC_ADC0LTH  _SFR_MEM8(0x0247)
#define VADC_ADC1HT  _SFR_MEM16(0x0248)
#define VADC_ADC1HTL  _SFR_MEM8(0x0248)
#define VADC_ADC1HTH  _SFR_MEM8(0x0249)
#define VADC_ADC1LT  _SFR_MEM16(0x024A)
#define VADC_ADC1LTL  _SFR_MEM8(0x024A)
#define VADC_ADC1LTH  _SFR_MEM8(0x024B)
#define VADC_PVNVHT  _SFR_MEM16(0x024C)
#define VADC_PVNVHTL  _SFR_MEM8(0x024C)
#define VADC_PVNVHTH  _SFR_MEM8(0x024D)
#define VADC_PVNVLT  _SFR_MEM16(0x024E)
#define VADC_PVNVLTL  _SFR_MEM8(0x024E)
#define VADC_PVNVLTH  _SFR_MEM8(0x024F)


/* CADC - Current ADC */
#define CADC_CTRLA  _SFR_MEM8(0x0280)
#define CADC_CTRLB  _SFR_MEM8(0x0281)
#define CADC_CTRLC  _SFR_MEM8(0x0282)
#define CADC_INTCTRL  _SFR_MEM8(0x0283)
#define CADC_DIAGNOSIS  _SFR_MEM8(0x0284)
#define CADC_STATUS  _SFR_MEM8(0x0285)
#define CADC_PROTECTION  _SFR_MEM8(0x0286)
#define CADC_INST  _SFR_MEM16(0x0287)
#define CADC_INSTL  _SFR_MEM8(0x0287)
#define CADC_INSTH  _SFR_MEM8(0x0288)
#define CADC_ACC  _SFR_MEM32(0x0289)
#define CADC_ACC0  _SFR_MEM8(0x0289)
#define CADC_ACC1  _SFR_MEM8(0x028A)
#define CADC_ACC2  _SFR_MEM8(0x028B)
#define CADC_ACC3  _SFR_MEM8(0x028C)
#define CADC_I2INST  _SFR_MEM8(0x028D)
#define CADC_I2ACC  _SFR_MEM16(0x028E)
#define CADC_I2ACCL  _SFR_MEM8(0x028E)
#define CADC_I2ACCH  _SFR_MEM8(0x028F)
#define CADC_PHTHRES  _SFR_MEM16(0x0290)
#define CADC_PHTHRESL  _SFR_MEM8(0x0290)
#define CADC_PHTHRESH  _SFR_MEM8(0x0291)
#define CADC_PLTHRES  _SFR_MEM16(0x0292)
#define CADC_PLTHRESL  _SFR_MEM8(0x0292)
#define CADC_PLTHRESH  _SFR_MEM8(0x0293)
#define CADC_SHTHRES  _SFR_MEM16(0x0294)
#define CADC_SHTHRESL  _SFR_MEM8(0x0294)
#define CADC_SHTHRESH  _SFR_MEM8(0x0295)
#define CADC_SLTHRES  _SFR_MEM16(0x0296)
#define CADC_SLTHRESL  _SFR_MEM8(0x0296)
#define CADC_SLTHRESH  _SFR_MEM8(0x0297)


/* VREF - Voltage Reference */
#define VREF_CTRLA  _SFR_MEM8(0x02A2)
#define VREF_STATUS  _SFR_MEM8(0x02A4)


