gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* CPROT - DAC-Based Current Protection */
#define CPROT_CTRL  _SFR_MEM8(0x02B0)
#define CPROT_SCTIMING  _SFR_MEM8(0x02B1)
#define CPROT_OCTIMING  _SFR_MEM8(0x02B2)
#define CPROT_SCLEVEL  _SFR_MEM8(0x02B3)
#define CPROT_COCLEVEL  _SFR_MEM8(0x02B4)
#define CPROT_DOCLEVEL  _SFR_MEM8(0x02B5)
#define CPROT_OCREG  _SFR_MEM8(0x02B6)


/* FET - FET controller */
#define FET_CTRLA  _SFR_MEM8(0x03C0)
#define FET_CTRLB  _SFR_MEM8(0x03C1)
#define FET_FETACTIONA  _SFR_MEM8(0x03C4)
#define FET_FETACTIONE  _SFR_MEM8(0x03C8)
#define FET_FETACTIONF  _SFR_MEM8(0x03C9)
#define FET_FETACTIONG  _SFR_MEM8(0x03CA)
#define FET_INTCTRL  _SFR_MEM8(0x03D0)
#define FET_INTMASKA  _SFR_MEM8(0x03D2)
#define FET_INTMASKC  _SFR_MEM8(0x03D4)
#define FET_INTMASKD  _SFR_MEM8(0x03D5)
#define FET_STATUSA  _SFR_MEM8(0x03D8)
#define FET_STATUSC  _SFR_MEM8(0x03DA)
#define FET_STATUSD  _SFR_MEM8(0x03DB)
#define FET_FETACTIONN  _SFR_MEM8(0x03DF)


/* BCD - Bus Connect/Disconnect */
#define BCD_CTRL  _SFR_MEM8(0x03E0)
#define BCD_STATUS  _SFR_MEM8(0x03E1)


/* COMTR - Communication Timeout */
#define COMTR_CTRL  _SFR_MEM8(0x03E2)
#define COMTR_STATUS  _SFR_MEM8(0x03E3)


/* USART (USARTC) - Universal Synchronous/Asynchronous Receiver/Transmitter */
#define USARTC_DATA  _SFR_MEM8(0x03E8)
#define USARTC_STATUS  _SFR_MEM8(0x03E9)
#define USARTC_CTRLD  _SFR_MEM8(0x03EA)
#define USARTC_CTRLA  _SFR_MEM8(0x03EB)
#define USARTC_CTRLB  _SFR_MEM8(0x03EC)
#define USARTC_CTRLC  _SFR_MEM8(0x03ED)
#define USARTC_BAUDCTRLA  _SFR_MEM8(0x03EE)
#define USARTC_BAUDCTRLB  _SFR_MEM8(0x03EF)


/* TWI (TWIC) - Two-Wire Interface */
#define TWIC_CTRL  _SFR_MEM8(0x03F0)
#define TWIC_SLAVE_CTRLA  _SFR_MEM8(0x03F8)
#define TWIC_SLAVE_CTRLB  _SFR_MEM8(0x03F9)
#define TWIC_SLAVE_STATUS  _SFR_MEM8(0x03FA)
#define TWIC_SLAVE_ADDR  _SFR_MEM8(0x03FB)
#define TWIC_SLAVE_DATA  _SFR_MEM8(0x03FC)
#define TWIC_SLAVE_ADDRMASK  _SFR_MEM8(0x03FD)




/* TIM8_16 (TIMER) - Timer 8/16 bit */
#define TIMER_CTRLA  _SFR_MEM8(0x0400)
#define TIMER_CTRLB  _SFR_MEM8(0x0401)
#define TIMER_INTMSK  _SFR_MEM8(0x0402)
#define TIMER_STATUS  _SFR_MEM8(0x0403)
#define TIMER_TEMP  _SFR_MEM8(0x0404)
#define TIMER_COUNTL  _SFR_MEM8(0x0408)
#define TIMER_COUNTH  _SFR_MEM8(0x0409)
#define TIMER_OCRA  _SFR_MEM8(0x040A)
#define TIMER_OCRB  _SFR_MEM8(0x040B)


/* TIMPRESC - Timer Prescaler */
#define TIMPRESC_PRESC  _SFR_MEM8(0x0420)


/* PORT (PORTA) - I/O Ports */
#define PORTA_DIR  _SFR_MEM8(0x0480)
#define PORTA_OUT  _SFR_MEM8(0x0484)
#define PORTA_IN  _SFR_MEM8(0x0488)
#define PORTA_INTCTRL  _SFR_MEM8(0x0489)
#define PORTA_INT0MASK  _SFR_MEM8(0x048A)
#define PORTA_INT1MASK  _SFR_MEM8(0x048B)
#define PORTA_INTFLAGS  _SFR_MEM8(0x048C)
#define PORTA_PIN0CTRL  _SFR_MEM8(0x0490)
#define PORTA_PIN1CTRL  _SFR_MEM8(0x0491)
#define PORTA_PIN2CTRL  _SFR_MEM8(0x0492)


/* PORT (PORTB) - I/O Ports */
#define PORTB_DIR  _SFR_MEM8(0x04A0)
#define PORTB_OUT  _SFR_MEM8(0x04A4)
#define PORTB_IN  _SFR_MEM8(0x04A8)
#define PORTB_INTCTRL  _SFR_MEM8(0x04A9)
#define PORTB_INT0MASK  _SFR_MEM8(0x04AA)
#define PORTB_INT1MASK  _SFR_MEM8(0x04AB)
#define PORTB_INTFLAGS  _SFR_MEM8(0x04AC)
#define PORTB_PIN0CTRL  _SFR_MEM8(0x04B0)
#define PORTB_PIN1CTRL  _SFR_MEM8(0x04B1)
#define PORTB_PIN2CTRL  _SFR_MEM8(0x04B2)


/* PORT (PORTC) - I/O Ports */
#define PORTC_DIR  _SFR_MEM8(0x04C0)
#define PORTC_OUT  _SFR_MEM8(0x04C4)
#define PORTC_IN  _SFR_MEM8(0x04C8)
#define PORTC_INTCTRL  _SFR_MEM8(0x04C9)
#define PORTC_INT0MASK  _SFR_MEM8(0x04CA)
#define PORTC_INT1MASK  _SFR_MEM8(0x04CB)
#define PORTC_INTFLAGS  _SFR_MEM8(0x04CC)
#define PORTC_PIN0CTRL  _SFR_MEM8(0x04D0)
#define PORTC_PIN1CTRL  _SFR_MEM8(0x04D1)
#define PORTC_PIN2CTRL  _SFR_MEM8(0x04D2)


/* PORT (PORTD) - I/O Ports */
#define PORTD_DIR  _SFR_MEM8(0x04E0)
#define PORTD_OUT  _SFR_MEM8(0x04E4)
#define PORTD_IN  _SFR_MEM8(0x04E8)
#define PORTD_INTCTRL  _SFR_MEM8(0x04E9)
#define PORTD_INT0MASK  _SFR_MEM8(0x04EA)
#define PORTD_INT1MASK  _SFR_MEM8(0x04EB)
#define PORTD_INTFLAGS  _SFR_MEM8(0x04EC)
#define PORTD_PIN0CTRL  _SFR_MEM8(0x04F0)
#define PORTD_PIN1CTRL  _SFR_MEM8(0x04F1)
#define PORTD_PIN2CTRL  _SFR_MEM8(0x04F2)



/*================== Bitfield Definitions ================== */

/* BCD - Bus Connect/Disconnect on Communication Lines */
/* BCD.CTRL  bit masks and bit positions */
#define BCD_MODE_gm  0x03  /* Mode group mask. */
#define BCD_MODE_gp  0  /* Mode group position. */
#define BCD_MODE0_bm  (1<<0)  /* Mode bit 0 mask. */
#define BCD_MODE0_bp  0  /* Mode bit 0 position. */
#define BCD_MODE1_bm  (1<<1)  /* Mode bit 1 mask. */
#define BCD_MODE1_bp  1  /* Mode bit 1 position. */
#define BCD_TIMEOUT_gm  0x0C  /* Timeout group mask. */
#define BCD_TIMEOUT_gp  2  /* Timeout group position. */
#define BCD_TIMEOUT0_bm  (1<<2)  /* Timeout bit 0 mask. */
#define BCD_TIMEOUT0_bp  2  /* Timeout bit 0 position. */
#define BCD_TIMEOUT1_bm  (1<<3)  /* Timeout bit 1 mask. */
#define BCD_TIMEOUT1_bp  3  /* Timeout bit 1 position. */
#define BCD_INTLVL_gm  0x30  /* Interrupt Level group mask. */
#define BCD_INTLVL_gp  4  /* Interrupt Level group position. */
#define BCD_INTLVL0_bm  (1<<4)  /* Interrupt Level bit 0 mask. */
#define BCD_INTLVL0_bp  4  /* Interrupt Level bit 0 position. */
#define BCD_INTLVL1_bm  (1<<5)  /* Interrupt Level bit 1 mask. */
#define BCD_INTLVL1_bp  5  /* Interrupt Level bit 1 position. */
#define BCD_INTPOL_bm  0x40  /* Interrupt Polarity bit mask. */
#define BCD_INTPOL_bp  6  /* Interrupt Polarity bit position. */

/* BCD.STATUS  bit masks and bit positions */
#define BCD_CDIF_bm  0x01  /* Connect/Disconnect Interrupt Flag bit mask. */
#define BCD_CDIF_bp  0  /* Connect/Disconnect Interrupt Flag bit position. */
#define BCD_SBSY_bm  0x80  /* Synchronization Busy bit mask. */
#define BCD_SBSY_bp  7  /* Synchronization Busy bit position. */

/* CADC - Current ADC */
/* CADC.CTRLA  bit masks and bit positions */
#define CADC_ENABLE_bm  0x01  /* Enable bit mask. */
#define CADC_ENABLE_bp  0  /* Enable bit position. */
#define CADC_SME_bm  0x02  /* Sample Mode Enable bit mask. */
#define CADC_SME_bp  1  /* Sample Mode Enable bit position. */
#define CADC_POLARITY_bm  0x04  /* Polarity Select bit mask. */
#define CADC_POLARITY_bp  2  /* Polarity Select bit position. */

