gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* CADC.CTRLB  bit masks and bit positions */
#define CADC_ACDEC_gm  0x03  /* Accumulated Decimation Ratio group mask. */
#define CADC_ACDEC_gp  0  /* Accumulated Decimation Ratio group position. */
#define CADC_ACDEC0_bm  (1<<0)  /* Accumulated Decimation Ratio bit 0 mask. */
#define CADC_ACDEC0_bp  0  /* Accumulated Decimation Ratio bit 0 position. */
#define CADC_ACDEC1_bm  (1<<1)  /* Accumulated Decimation Ratio bit 1 mask. */
#define CADC_ACDEC1_bp  1  /* Accumulated Decimation Ratio bit 1 position. */
#define CADC_ICDEC_bm  0x08  /* Instantaneous Decimation Ratio bit mask. */
#define CADC_ICDEC_bp  3  /* Instantaneous Decimation Ratio bit position. */
#define CADC_ACHEN_bm  0x20  /* Automatic Chopping Enable bit mask. */
#define CADC_ACHEN_bp  5  /* Automatic Chopping Enable bit position. */
#define CADC_CLKS_bm  0x40  /* Clock Select bit mask. */
#define CADC_CLKS_bp  6  /* Clock Select bit position. */

/* CADC.CTRLC  bit masks and bit positions */
#define CADC_SAI_gm  0x03  /* Sampling Interval group mask. */
#define CADC_SAI_gp  0  /* Sampling Interval group position. */
#define CADC_SAI0_bm  (1<<0)  /* Sampling Interval bit 0 mask. */
#define CADC_SAI0_bp  0  /* Sampling Interval bit 0 position. */
#define CADC_SAI1_bm  (1<<1)  /* Sampling Interval bit 1 mask. */
#define CADC_SAI1_bp  1  /* Sampling Interval bit 1 position. */
#define CADC_PSES_bm  0x10  /* Polarity Synchronization Edge Select bit mask. */
#define CADC_PSES_bp  4  /* Polarity Synchronization Edge Select bit position. */

/* CADC.INTCTRL  bit masks and bit positions */
#define CADC_SMINTLVL_gm  0x03  /* Sample Mode Interrupt Level group mask. */
#define CADC_SMINTLVL_gp  0  /* Sample Mode Interrupt Level group position. */
#define CADC_SMINTLVL0_bm  (1<<0)  /* Sample Mode Interrupt Level bit 0 mask. */
#define CADC_SMINTLVL0_bp  0  /* Sample Mode Interrupt Level bit 0 position. */
#define CADC_SMINTLVL1_bm  (1<<1)  /* Sample Mode Interrupt Level bit 1 mask. */
#define CADC_SMINTLVL1_bp  1  /* Sample Mode Interrupt Level bit 1 position. */
#define CADC_ICIM_bm  0x04  /* Instantaneous Interrupt Mask bit mask. */
#define CADC_ICIM_bp  2  /* Instantaneous Interrupt Mask bit position. */
#define CADC_ACIM_bm  0x08  /* Accumulated Interrupt Mask bit mask. */
#define CADC_ACIM_bp  3  /* Accumulated Interrupt Mask bit position. */
#define CADC_CCINTLVL_gm  0x30  /* Conversion Complete Interrupt Level group mask. */
#define CADC_CCINTLVL_gp  4  /* Conversion Complete Interrupt Level group position. */
#define CADC_CCINTLVL0_bm  (1<<4)  /* Conversion Complete Interrupt Level bit 0 mask. */
#define CADC_CCINTLVL0_bp  4  /* Conversion Complete Interrupt Level bit 0 position. */
#define CADC_CCINTLVL1_bm  (1<<5)  /* Conversion Complete Interrupt Level bit 1 mask. */
#define CADC_CCINTLVL1_bp  5  /* Conversion Complete Interrupt Level bit 1 position. */

/* CADC.DIAGNOSIS  bit masks and bit positions */
#define CADC_PINDM_gm  0x03  /* Pin Diagnostics Mode group mask. */
#define CADC_PINDM_gp  0  /* Pin Diagnostics Mode group position. */
#define CADC_PINDM0_bm  (1<<0)  /* Pin Diagnostics Mode bit 0 mask. */
#define CADC_PINDM0_bp  0  /* Pin Diagnostics Mode bit 0 position. */
#define CADC_PINDM1_bm  (1<<1)  /* Pin Diagnostics Mode bit 1 mask. */
#define CADC_PINDM1_bp  1  /* Pin Diagnostics Mode bit 1 position. */

/* CADC.STATUS  bit masks and bit positions */
#define CADC_ICIF_bm  0x01  /* Instantaneous Conversion Interrupt Flag bit mask. */
#define CADC_ICIF_bp  0  /* Instantaneous Conversion Interrupt Flag bit position. */
#define CADC_ACIF_bm  0x02  /* Accumulated Conversion Interrupt Flag bit mask. */
#define CADC_ACIF_bp  1  /* Accumulated Conversion Interrupt Flag bit position. */
#define CADC_SMIF_bm  0x04  /* Sample Mode Interrupt Flag bit mask. */
#define CADC_SMIF_bp  2  /* Sample Mode Interrupt Flag bit position. */
#define CADC_RLF_bm  0x08  /* Registers Locked Flag bit mask. */
#define CADC_RLF_bp  3  /* Registers Locked Flag bit position. */
#define CADC_ICSSS_bm  0x10  /* Instantaneous Settling Sample Status bit mask. */
#define CADC_ICSSS_bp  4  /* Instantaneous Settling Sample Status bit position. */
#define CADC_ACSSS_bm  0x20  /* Accumulated Settling Sample Status bit mask. */
#define CADC_ACSSS_bp  5  /* Accumulated Settling Sample Status bit position. */
#define CADC_SBSY_bm  0x40  /* Synchronization Busy bit mask. */
#define CADC_SBSY_bp  6  /* Synchronization Busy bit position. */

/* CADC.PROTECTION  bit masks and bit positions */
#define CADC_PROTCNT_gm  0x7F  /* Protection Count group mask. */
#define CADC_PROTCNT_gp  0  /* Protection Count group position. */
#define CADC_PROTCNT0_bm  (1<<0)  /* Protection Count bit 0 mask. */
#define CADC_PROTCNT0_bp  0  /* Protection Count bit 0 position. */
#define CADC_PROTCNT1_bm  (1<<1)  /* Protection Count bit 1 mask. */
#define CADC_PROTCNT1_bp  1  /* Protection Count bit 1 position. */
#define CADC_PROTCNT2_bm  (1<<2)  /* Protection Count bit 2 mask. */
#define CADC_PROTCNT2_bp  2  /* Protection Count bit 2 position. */
#define CADC_PROTCNT3_bm  (1<<3)  /* Protection Count bit 3 mask. */
#define CADC_PROTCNT3_bp  3  /* Protection Count bit 3 position. */
#define CADC_PROTCNT4_bm  (1<<4)  /* Protection Count bit 4 mask. */
#define CADC_PROTCNT4_bp  4  /* Protection Count bit 4 position. */
#define CADC_PROTCNT5_bm  (1<<5)  /* Protection Count bit 5 mask. */
#define CADC_PROTCNT5_bp  5  /* Protection Count bit 5 position. */
#define CADC_PROTCNT6_bm  (1<<6)  /* Protection Count bit 6 mask. */
#define CADC_PROTCNT6_bp  6  /* Protection Count bit 6 position. */
#define CADC_WCIVS_bm  0x80  /* Window Comparator Input Value Select bit mask. */
#define CADC_WCIVS_bp  7  /* Window Comparator Input Value Select bit position. */









/* CLK - Clock System */
/* CLK.CLKPSR  bit masks and bit positions */
#define CLK_CLKPDIV_gm  0x03  /* Clock Prescale Divide Factor group mask. */
#define CLK_CLKPDIV_gp  0  /* Clock Prescale Divide Factor group position. */
#define CLK_CLKPDIV0_bm  (1<<0)  /* Clock Prescale Divide Factor bit 0 mask. */
#define CLK_CLKPDIV0_bp  0  /* Clock Prescale Divide Factor bit 0 position. */
#define CLK_CLKPDIV1_bm  (1<<1)  /* Clock Prescale Divide Factor bit 1 mask. */
#define CLK_CLKPDIV1_bp  1  /* Clock Prescale Divide Factor bit 1 position. */

/* CLK.CLKSLR  bit masks and bit positions */
#define CLK_CLKSL_bm  0x01  /* Clock Settings Lock bit mask. */
#define CLK_CLKSL_bp  0  /* Clock Settings Lock bit position. */

