gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* COMTR - Communication Timeout Reset */
/* COMTR.CTRL  bit masks and bit positions */
#define COMTR_ENABLE_bm  0x01  /* Enable Communication Timeout Reset bit mask. */
#define COMTR_ENABLE_bp  0  /* Enable Communication Timeout Reset bit position. */

/* COMTR.STATUS  bit masks and bit positions */
#define COMTR_SBSY_bm  0x80  /* Synchronization Busy bit mask. */
#define COMTR_SBSY_bp  7  /* Synchronization Busy bit position. */

/* CPROT - DAC-Based Current Protection */
/* CPROT.CTRL  bit masks and bit positions */
#define CPROT_COCE_bm  0x01  /* Charge Over Current Protection Enable bit mask. */
#define CPROT_COCE_bp  0  /* Charge Over Current Protection Enable bit position. */
#define CPROT_DOCE_bm  0x02  /* Discharge Over Current Protection Enable bit mask. */
#define CPROT_DOCE_bp  1  /* Discharge Over Current Protection Enable bit position. */
#define CPROT_SCE_bm  0x04  /* Short Circuit protection enable bit mask. */
#define CPROT_SCE_bp  2  /* Short Circuit protection enable bit position. */
#define CPROT_PRMD_bm  0x08  /* Power Reduction Mode Disable bit mask. */
#define CPROT_PRMD_bp  3  /* Power Reduction Mode Disable bit position. */

/* CPROT.SCTIMING  bit masks and bit positions */
#define CPROT_VIOCNT_gm  0x0F  /* Short Circuit Protection Violation Count group mask. */
#define CPROT_VIOCNT_gp  0  /* Short Circuit Protection Violation Count group position. */
#define CPROT_VIOCNT0_bm  (1<<0)  /* Short Circuit Protection Violation Count bit 0 mask. */
#define CPROT_VIOCNT0_bp  0  /* Short Circuit Protection Violation Count bit 0 position. */
#define CPROT_VIOCNT1_bm  (1<<1)  /* Short Circuit Protection Violation Count bit 1 mask. */
#define CPROT_VIOCNT1_bp  1  /* Short Circuit Protection Violation Count bit 1 position. */
#define CPROT_VIOCNT2_bm  (1<<2)  /* Short Circuit Protection Violation Count bit 2 mask. */
#define CPROT_VIOCNT2_bp  2  /* Short Circuit Protection Violation Count bit 2 position. */
#define CPROT_VIOCNT3_bm  (1<<3)  /* Short Circuit Protection Violation Count bit 3 mask. */
#define CPROT_VIOCNT3_bp  3  /* Short Circuit Protection Violation Count bit 3 position. */
#define CPROT_TKSEL_gm  0x70  /* Short Circuit Protection Time Keeper Channel Select group mask. */
#define CPROT_TKSEL_gp  4  /* Short Circuit Protection Time Keeper Channel Select group position. */
#define CPROT_TKSEL0_bm  (1<<4)  /* Short Circuit Protection Time Keeper Channel Select bit 0 mask. */
#define CPROT_TKSEL0_bp  4  /* Short Circuit Protection Time Keeper Channel Select bit 0 position. */
#define CPROT_TKSEL1_bm  (1<<5)  /* Short Circuit Protection Time Keeper Channel Select bit 1 mask. */
#define CPROT_TKSEL1_bp  5  /* Short Circuit Protection Time Keeper Channel Select bit 1 position. */
#define CPROT_TKSEL2_bm  (1<<6)  /* Short Circuit Protection Time Keeper Channel Select bit 2 mask. */
#define CPROT_TKSEL2_bp  6  /* Short Circuit Protection Time Keeper Channel Select bit 2 position. */

/* CPROT.OCTIMING  bit masks and bit positions */
/* CPROT_VIOCNT  is already defined. */
/* CPROT_TKSEL  is already defined. */

/* CPROT.SCLEVEL  bit masks and bit positions */
#define CPROT_DETLVL_gm  0x3F  /* Short Circuit Detection Level group mask. */
#define CPROT_DETLVL_gp  0  /* Short Circuit Detection Level group position. */
#define CPROT_DETLVL0_bm  (1<<0)  /* Short Circuit Detection Level bit 0 mask. */
#define CPROT_DETLVL0_bp  0  /* Short Circuit Detection Level bit 0 position. */
#define CPROT_DETLVL1_bm  (1<<1)  /* Short Circuit Detection Level bit 1 mask. */
#define CPROT_DETLVL1_bp  1  /* Short Circuit Detection Level bit 1 position. */
#define CPROT_DETLVL2_bm  (1<<2)  /* Short Circuit Detection Level bit 2 mask. */
#define CPROT_DETLVL2_bp  2  /* Short Circuit Detection Level bit 2 position. */
#define CPROT_DETLVL3_bm  (1<<3)  /* Short Circuit Detection Level bit 3 mask. */
#define CPROT_DETLVL3_bp  3  /* Short Circuit Detection Level bit 3 position. */
#define CPROT_DETLVL4_bm  (1<<4)  /* Short Circuit Detection Level bit 4 mask. */
#define CPROT_DETLVL4_bp  4  /* Short Circuit Detection Level bit 4 position. */
#define CPROT_DETLVL5_bm  (1<<5)  /* Short Circuit Detection Level bit 5 mask. */
#define CPROT_DETLVL5_bp  5  /* Short Circuit Detection Level bit 5 position. */

/* CPROT.COCLEVEL  bit masks and bit positions */
/* CPROT_DETLVL  is already defined. */

/* CPROT.DOCLEVEL  bit masks and bit positions */
/* CPROT_DETLVL  is already defined. */

/* CPROT.OCREG  bit masks and bit positions */
#define CPROT_OFFSET_gm  0x1F  /* Offset Value group mask. */
#define CPROT_OFFSET_gp  0  /* Offset Value group position. */
#define CPROT_OFFSET0_bm  (1<<0)  /* Offset Value bit 0 mask. */
#define CPROT_OFFSET0_bp  0  /* Offset Value bit 0 position. */
#define CPROT_OFFSET1_bm  (1<<1)  /* Offset Value bit 1 mask. */
#define CPROT_OFFSET1_bp  1  /* Offset Value bit 1 position. */
#define CPROT_OFFSET2_bm  (1<<2)  /* Offset Value bit 2 mask. */
#define CPROT_OFFSET2_bp  2  /* Offset Value bit 2 position. */
#define CPROT_OFFSET3_bm  (1<<3)  /* Offset Value bit 3 mask. */
#define CPROT_OFFSET3_bp  3  /* Offset Value bit 3 position. */
#define CPROT_OFFSET4_bm  (1<<4)  /* Offset Value bit 4 mask. */
#define CPROT_OFFSET4_bp  4  /* Offset Value bit 4 position. */

/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP7_bp  7  /* CCP signature bit 7 position. */



/* CPU.SREG  bit masks and bit positions */
#define CPU_C_bm  0x01  /* Carry Flag bit mask. */
#define CPU_C_bp  0  /* Carry Flag bit position. */
#define CPU_Z_bm  0x02  /* Zero Flag bit mask. */
#define CPU_Z_bp  1  /* Zero Flag bit position. */
#define CPU_N_bm  0x04  /* Negative Flag bit mask. */
#define CPU_N_bp  2  /* Negative Flag bit position. */
#define CPU_V_bm  0x08  /* Two's Complement Overflow Flag bit mask. */
#define CPU_V_bp  3  /* Two's Complement Overflow Flag bit position. */
#define CPU_S_bm  0x10  /* N Exclusive Or V Flag bit mask. */
#define CPU_S_bp  4  /* N Exclusive Or V Flag bit position. */
#define CPU_H_bm  0x20  /* Half Carry Flag bit mask. */
#define CPU_H_bp  5  /* Half Carry Flag bit position. */
#define CPU_T_bm  0x40  /* Transfer Bit bit mask. */
#define CPU_T_bp  6  /* Transfer Bit bit position. */
#define CPU_I_bm  0x80  /* Global Interrupt Enable Flag bit mask. */
#define CPU_I_bp  7  /* Global Interrupt Enable Flag bit position. */

/* CRC - Cyclic Redundancy Checker */
/* CRC.CTRL  bit masks and bit positions */
#define CRC_SOURCE_gm  0x07  /* Input Source group mask. */
#define CRC_SOURCE_gp  0  /* Input Source group position. */
#define CRC_SOURCE0_bm  (1<<0)  /* Input Source bit 0 mask. */
#define CRC_SOURCE0_bp  0  /* Input Source bit 0 position. */
#define CRC_SOURCE1_bm  (1<<1)  /* Input Source bit 1 mask. */
#define CRC_SOURCE1_bp  1  /* Input Source bit 1 position. */
#define CRC_SOURCE2_bm  (1<<2)  /* Input Source bit 2 mask. */
#define CRC_SOURCE2_bp  2  /* Input Source bit 2 position. */
#define CRC_CRC32_bm  0x20  /* CRC Mode bit mask. */
#define CRC_CRC32_bp  5  /* CRC Mode bit position. */
#define CRC_RESET_gm  0xC0  /* Reset group mask. */
#define CRC_RESET_gp  6  /* Reset group position. */
#define CRC_RESET0_bm  (1<<6)  /* Reset bit 0 mask. */
#define CRC_RESET0_bp  6  /* Reset bit 0 position. */
#define CRC_RESET1_bm  (1<<7)  /* Reset bit 1 mask. */
#define CRC_RESET1_bp  7  /* Reset bit 1 position. */

/* CRC.STATUS  bit masks and bit positions */
#define CRC_BUSY_bm  0x01  /* Busy bit mask. */
#define CRC_BUSY_bp  0  /* Busy bit position. */
#define CRC_ZERO_bm  0x02  /* Zero detection bit mask. */
#define CRC_ZERO_bp  1  /* Zero detection bit position. */






/* FET - FET controller */
/* FET.CTRLA  bit masks and bit positions */
#define FET_CFE_bm  0x01  /* Charge FET Enable bit mask. */
#define FET_CFE_bp  0  /* Charge FET Enable bit position. */
#define FET_DFE_bm  0x02  /* Discharge FET enable bit mask. */
#define FET_DFE_bp  1  /* Discharge FET enable bit position. */
#define FET_HIVGS_bm  0x04  /* High VGS mode bit mask. */
#define FET_HIVGS_bp  2  /* High VGS mode bit position. */
#define FET_HICURR_bm  0x08  /* High Current mode bit mask. */
#define FET_HICURR_bp  3  /* High Current mode bit position. */
#define FET_DUVREN_bm  0x10  /* DUVR enable bit mask. */
#define FET_DUVREN_bp  4  /* DUVR enable bit position. */
#define FET_DUVRLVL_gm  0xE0  /* DUVR level group mask. */
#define FET_DUVRLVL_gp  5  /* DUVR level group position. */
#define FET_DUVRLVL0_bm  (1<<5)  /* DUVR level bit 0 mask. */
#define FET_DUVRLVL0_bp  5  /* DUVR level bit 0 position. */
#define FET_DUVRLVL1_bm  (1<<6)  /* DUVR level bit 1 mask. */
#define FET_DUVRLVL1_bp  6  /* DUVR level bit 1 position. */
#define FET_DUVRLVL2_bm  (1<<7)  /* DUVR level bit 2 mask. */
#define FET_DUVRLVL2_bp  7  /* DUVR level bit 2 position. */

/* FET.CTRLB  bit masks and bit positions */
#define FET_HIFREQTIME_gm  0x07  /* High Frequency Time Selection group mask. */
#define FET_HIFREQTIME_gp  0  /* High Frequency Time Selection group position. */
#define FET_HIFREQTIME0_bm  (1<<0)  /* High Frequency Time Selection bit 0 mask. */
#define FET_HIFREQTIME0_bp  0  /* High Frequency Time Selection bit 0 position. */
#define FET_HIFREQTIME1_bm  (1<<1)  /* High Frequency Time Selection bit 1 mask. */
#define FET_HIFREQTIME1_bp  1  /* High Frequency Time Selection bit 1 position. */
#define FET_HIFREQTIME2_bm  (1<<2)  /* High Frequency Time Selection bit 2 mask. */
#define FET_HIFREQTIME2_bp  2  /* High Frequency Time Selection bit 2 position. */
#define FET_HIFREQ_gm  0x30  /* High Frequency Select group mask. */
#define FET_HIFREQ_gp  4  /* High Frequency Select group position. */
#define FET_HIFREQ0_bm  (1<<4)  /* High Frequency Select bit 0 mask. */
#define FET_HIFREQ0_bp  4  /* High Frequency Select bit 0 position. */
#define FET_HIFREQ1_bm  (1<<5)  /* High Frequency Select bit 1 mask. */
#define FET_HIFREQ1_bp  5  /* High Frequency Select bit 1 position. */

/* FET.FETACTIONA  bit masks and bit positions */
#define FET_DHCF_gm  0x03  /* Discharge High Current Protection FET Control group mask. */
#define FET_DHCF_gp  0  /* Discharge High Current Protection FET Control group position. */
#define FET_DHCF0_bm  (1<<0)  /* Discharge High Current Protection FET Control bit 0 mask. */
#define FET_DHCF0_bp  0  /* Discharge High Current Protection FET Control bit 0 position. */
#define FET_DHCF1_bm  (1<<1)  /* Discharge High Current Protection FET Control bit 1 mask. */
#define FET_DHCF1_bp  1  /* Discharge High Current Protection FET Control bit 1 position. */
#define FET_CHCF_gm  0x0C  /* Charge High Current Protection FET Control group mask. */
#define FET_CHCF_gp  2  /* Charge High Current Protection FET Control group position. */
#define FET_CHCF0_bm  (1<<2)  /* Charge High Current Protection FET Control bit 0 mask. */
#define FET_CHCF0_bp  2  /* Charge High Current Protection FET Control bit 0 position. */
#define FET_CHCF1_bm  (1<<3)  /* Charge High Current Protection FET Control bit 1 mask. */
#define FET_CHCF1_bp  3  /* Charge High Current Protection FET Control bit 1 position. */

/* FET.FETACTIONE  bit masks and bit positions */
#define FET_ITUVF_gm  0x03  /* Internal Temperature Under-voltage Protection FET Control group mask. */
#define FET_ITUVF_gp  0  /* Internal Temperature Under-voltage Protection FET Control group position. */
#define FET_ITUVF0_bm  (1<<0)  /* Internal Temperature Under-voltage Protection FET Control bit 0 mask. */
#define FET_ITUVF0_bp  0  /* Internal Temperature Under-voltage Protection FET Control bit 0 position. */
#define FET_ITUVF1_bm  (1<<1)  /* Internal Temperature Under-voltage Protection FET Control bit 1 mask. */
#define FET_ITUVF1_bp  1  /* Internal Temperature Under-voltage Protection FET Control bit 1 position. */
#define FET_ITOVF_gm  0x0C  /* Internal Temperature Over-voltage Protection FET Control group mask. */
#define FET_ITOVF_gp  2  /* Internal Temperature Over-voltage Protection FET Control group position. */
#define FET_ITOVF0_bm  (1<<2)  /* Internal Temperature Over-voltage Protection FET Control bit 0 mask. */
#define FET_ITOVF0_bp  2  /* Internal Temperature Over-voltage Protection FET Control bit 0 position. */
#define FET_ITOVF1_bm  (1<<3)  /* Internal Temperature Over-voltage Protection FET Control bit 1 mask. */
#define FET_ITOVF1_bp  3  /* Internal Temperature Over-voltage Protection FET Control bit 1 position. */
#define FET_A0UVF_gm  0x30  /* ADC0 Under-voltage Protection FET Control group mask. */
#define FET_A0UVF_gp  4  /* ADC0 Under-voltage Protection FET Control group position. */
#define FET_A0UVF0_bm  (1<<4)  /* ADC0 Under-voltage Protection FET Control bit 0 mask. */
#define FET_A0UVF0_bp  4  /* ADC0 Under-voltage Protection FET Control bit 0 position. */
#define FET_A0UVF1_bm  (1<<5)  /* ADC0 Under-voltage Protection FET Control bit 1 mask. */
#define FET_A0UVF1_bp  5  /* ADC0 Under-voltage Protection FET Control bit 1 position. */
#define FET_A0OVF_gm  0xC0  /* ADC0 Over-voltage Protection FET Control group mask. */
#define FET_A0OVF_gp  6  /* ADC0 Over-voltage Protection FET Control group position. */
#define FET_A0OVF0_bm  (1<<6)  /* ADC0 Over-voltage Protection FET Control bit 0 mask. */
#define FET_A0OVF0_bp  6  /* ADC0 Over-voltage Protection FET Control bit 0 position. */
#define FET_A0OVF1_bm  (1<<7)  /* ADC0 Over-voltage Protection FET Control bit 1 mask. */
#define FET_A0OVF1_bp  7  /* ADC0 Over-voltage Protection FET Control bit 1 position. */

/* FET.FETACTIONF  bit masks and bit positions */
#define FET_A1UVF_gm  0x03  /* ADC1 Under-voltage Protection FET Control group mask. */
#define FET_A1UVF_gp  0  /* ADC1 Under-voltage Protection FET Control group position. */
#define FET_A1UVF0_bm  (1<<0)  /* ADC1 Under-voltage Protection FET Control bit 0 mask. */
#define FET_A1UVF0_bp  0  /* ADC1 Under-voltage Protection FET Control bit 0 position. */
#define FET_A1UVF1_bm  (1<<1)  /* ADC1 Under-voltage Protection FET Control bit 1 mask. */
#define FET_A1UVF1_bp  1  /* ADC1 Under-voltage Protection FET Control bit 1 position. */
#define FET_A1OVF_gm  0x0C  /* ADC1 Over-voltage Protection FET Control group mask. */
#define FET_A1OVF_gp  2  /* ADC1 Over-voltage Protection FET Control group position. */
#define FET_A1OVF0_bm  (1<<2)  /* ADC1 Over-voltage Protection FET Control bit 0 mask. */
#define FET_A1OVF0_bp  2  /* ADC1 Over-voltage Protection FET Control bit 0 position. */
#define FET_A1OVF1_bm  (1<<3)  /* ADC1 Over-voltage Protection FET Control bit 1 mask. */
#define FET_A1OVF1_bp  3  /* ADC1 Over-voltage Protection FET Control bit 1 position. */
#define FET_CUVF_gm  0x30  /* Cell Under-voltage Protection FET Control group mask. */
#define FET_CUVF_gp  4  /* Cell Under-voltage Protection FET Control group position. */
#define FET_CUVF0_bm  (1<<4)  /* Cell Under-voltage Protection FET Control bit 0 mask. */
#define FET_CUVF0_bp  4  /* Cell Under-voltage Protection FET Control bit 0 position. */
#define FET_CUVF1_bm  (1<<5)  /* Cell Under-voltage Protection FET Control bit 1 mask. */
#define FET_CUVF1_bp  5  /* Cell Under-voltage Protection FET Control bit 1 position. */
#define FET_COVF_gm  0xC0  /* Cell Over-voltage Protection FET Control group mask. */
#define FET_COVF_gp  6  /* Cell Over-voltage Protection FET Control group position. */
#define FET_COVF0_bm  (1<<6)  /* Cell Over-voltage Protection FET Control bit 0 mask. */
#define FET_COVF0_bp  6  /* Cell Over-voltage Protection FET Control bit 0 position. */
#define FET_COVF1_bm  (1<<7)  /* Cell Over-voltage Protection FET Control bit 1 mask. */
#define FET_COVF1_bp  7  /* Cell Over-voltage Protection FET Control bit 1 position. */

