gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* FET.FETACTIONG  bit masks and bit positions */
#define FET_COCF_gm  0x03  /* Charge Over Current Protection FET Control group mask. */
#define FET_COCF_gp  0  /* Charge Over Current Protection FET Control group position. */
#define FET_COCF0_bm  (1<<0)  /* Charge Over Current Protection FET Control bit 0 mask. */
#define FET_COCF0_bp  0  /* Charge Over Current Protection FET Control bit 0 position. */
#define FET_COCF1_bm  (1<<1)  /* Charge Over Current Protection FET Control bit 1 mask. */
#define FET_COCF1_bp  1  /* Charge Over Current Protection FET Control bit 1 position. */
#define FET_DOCF_gm  0x0C  /* Discharge Over Current Protection FET Control group mask. */
#define FET_DOCF_gp  2  /* Discharge Over Current Protection FET Control group position. */
#define FET_DOCF0_bm  (1<<2)  /* Discharge Over Current Protection FET Control bit 0 mask. */
#define FET_DOCF0_bp  2  /* Discharge Over Current Protection FET Control bit 0 position. */
#define FET_DOCF1_bm  (1<<3)  /* Discharge Over Current Protection FET Control bit 1 mask. */
#define FET_DOCF1_bp  3  /* Discharge Over Current Protection FET Control bit 1 position. */
#define FET_SCF_gm  0x30  /* Short Circuit Protection FET Control group mask. */
#define FET_SCF_gp  4  /* Short Circuit Protection FET Control group position. */
#define FET_SCF0_bm  (1<<4)  /* Short Circuit Protection FET Control bit 0 mask. */
#define FET_SCF0_bp  4  /* Short Circuit Protection FET Control bit 0 position. */
#define FET_SCF1_bm  (1<<5)  /* Short Circuit Protection FET Control bit 1 mask. */
#define FET_SCF1_bp  5  /* Short Circuit Protection FET Control bit 1 position. */

/* FET.INTCTRL  bit masks and bit positions */
#define FET_INTLVL_gm  0x03  /* Protection Interrupt Level group mask. */
#define FET_INTLVL_gp  0  /* Protection Interrupt Level group position. */
#define FET_INTLVL0_bm  (1<<0)  /* Protection Interrupt Level bit 0 mask. */
#define FET_INTLVL0_bp  0  /* Protection Interrupt Level bit 0 position. */
#define FET_INTLVL1_bm  (1<<1)  /* Protection Interrupt Level bit 1 mask. */
#define FET_INTLVL1_bp  1  /* Protection Interrupt Level bit 1 position. */

/* FET.INTMASKA  bit masks and bit positions */
#define FET_DHCIM_bm  0x01  /* Discharge High Current Protection Interrupt Mask bit mask. */
#define FET_DHCIM_bp  0  /* Discharge High Current Protection Interrupt Mask bit position. */
#define FET_CHCIM_bm  0x02  /* Charge High Current Protection Interrupt Mask bit mask. */
#define FET_CHCIM_bp  1  /* Charge High Current Protection Interrupt Mask bit position. */

/* FET.INTMASKC  bit masks and bit positions */
#define FET_ITUVIM_bm  0x01  /* Internal Temperature Under-voltage Protection Interrupt Mask bit mask. */
#define FET_ITUVIM_bp  0  /* Internal Temperature Under-voltage Protection Interrupt Mask bit position. */
#define FET_ITOVIM_bm  0x02  /* Internal Temperature Over-voltage Protection Interrupt Mask bit mask. */
#define FET_ITOVIM_bp  1  /* Internal Temperature Over-voltage Protection Interrupt Mask bit position. */
#define FET_A0UVIM_bm  0x04  /* ADC0 Under-voltage Protection Interrupt Mask bit mask. */
#define FET_A0UVIM_bp  2  /* ADC0 Under-voltage Protection Interrupt Mask bit position. */
#define FET_A0OVIM_bm  0x08  /* ADC0 Over-voltage Protection Interrupt Mask bit mask. */
#define FET_A0OVIM_bp  3  /* ADC0 Over-voltage Protection Interrupt Mask bit position. */
#define FET_A1UVIM_bm  0x10  /* ADC1 Under-voltage Protection Interrupt Mask bit mask. */
#define FET_A1UVIM_bp  4  /* ADC1 Under-voltage Protection Interrupt Mask bit position. */
#define FET_A1OVIM_bm  0x20  /* ADC1 Over-voltage Protection Interrupt Mask bit mask. */
#define FET_A1OVIM_bp  5  /* ADC1 Over-voltage Protection Interrupt Mask bit position. */
#define FET_CUVIM_bm  0x40  /* Cell Under-voltage Protection Interrupt Mask bit mask. */
#define FET_CUVIM_bp  6  /* Cell Under-voltage Protection Interrupt Mask bit position. */
#define FET_COVIM_bm  0x80  /* Cell Over-voltage Protection Interrupt Mask bit mask. */
#define FET_COVIM_bp  7  /* Cell Over-voltage Protection Interrupt Mask bit position. */

/* FET.INTMASKD  bit masks and bit positions */
#define FET_COCIM_bm  0x01  /* Charge Over Current Protection Interrupt Mask bit mask. */
#define FET_COCIM_bp  0  /* Charge Over Current Protection Interrupt Mask bit position. */
#define FET_DOCIM_bm  0x02  /* Discharge Over Current Protection Interrupt Mask bit mask. */
#define FET_DOCIM_bp  1  /* Discharge Over Current Protection Interrupt Mask bit position. */
#define FET_SCIM_bm  0x04  /* Short Circuit Protection Interrupt Mask bit mask. */
#define FET_SCIM_bp  2  /* Short Circuit Protection Interrupt Mask bit position. */

/* FET.STATUSA  bit masks and bit positions */
#define FET_DHCIF_bm  0x01  /* Discharge High Current Protection Interrupt Flag bit mask. */
#define FET_DHCIF_bp  0  /* Discharge High Current Protection Interrupt Flag bit position. */
#define FET_CHCIF_bm  0x02  /* Charge High Current Protection Interrupt Flag bit mask. */
#define FET_CHCIF_bp  1  /* Charge High Current Protection Interrupt Flag bit position. */

/* FET.STATUSC  bit masks and bit positions */
#define FET_ITUVIF_bm  0x01  /* Internal Temperature Under-voltage Protection Interrupt Flag bit mask. */
#define FET_ITUVIF_bp  0  /* Internal Temperature Under-voltage Protection Interrupt Flag bit position. */
#define FET_ITOVIF_bm  0x02  /* Internal Temperature Over-voltage Protection Interrupt Flag bit mask. */
#define FET_ITOVIF_bp  1  /* Internal Temperature Over-voltage Protection Interrupt Flag bit position. */
#define FET_A0UVIF_bm  0x04  /* ADC0 Under-voltage Protection Interrupt Flag bit mask. */
#define FET_A0UVIF_bp  2  /* ADC0 Under-voltage Protection Interrupt Flag bit position. */
#define FET_A0OVIF_bm  0x08  /* ADC0 Over-voltage Protection Interrupt Flag bit mask. */
#define FET_A0OVIF_bp  3  /* ADC0 Over-voltage Protection Interrupt Flag bit position. */
#define FET_A1UVIF_bm  0x10  /* ADC1 Under-voltage Protection Interrupt Flag bit mask. */
#define FET_A1UVIF_bp  4  /* ADC1 Under-voltage Protection Interrupt Flag bit position. */
#define FET_A1OVIF_bm  0x20  /* ADC1 Over-voltage Protection Interrupt Flag bit mask. */
#define FET_A1OVIF_bp  5  /* ADC1 Over-voltage Protection Interrupt Flag bit position. */
#define FET_CUVIF_bm  0x40  /* Cell Under-voltage Protection Interrupt Flag bit mask. */
#define FET_CUVIF_bp  6  /* Cell Under-voltage Protection Interrupt Flag bit position. */
#define FET_COVIF_bm  0x80  /* Cell Over-voltage Protection Interrupt Flag bit mask. */
#define FET_COVIF_bp  7  /* Cell Over-voltage Protection Interrupt Flag bit position. */

/* FET.STATUSD  bit masks and bit positions */
#define FET_COCIF_bm  0x01  /* Charge Over Current Protection Interrupt Flag bit mask. */
#define FET_COCIF_bp  0  /* Charge Over Current Protection Interrupt Flag bit position. */
#define FET_DOCIF_bm  0x02  /* Discharge Over Current Protection Interrupt Flag bit mask. */
#define FET_DOCIF_bp  1  /* Discharge Over Current Protection Interrupt Flag bit position. */
#define FET_SCIF_bm  0x04  /* Short Circuit Protection Interrupt Flag bit mask. */
#define FET_SCIF_bp  2  /* Short Circuit Protection Interrupt Flag bit position. */

/* FET.FETACTIONN  bit masks and bit positions */
#define FET_UCF_gm  0x03  /*  group mask. */
#define FET_UCF_gp  0  /*  group position. */
#define FET_UCF0_bm  (1<<0)  /*  bit 0 mask. */
#define FET_UCF0_bp  0  /*  bit 0 position. */
#define FET_UCF1_bm  (1<<1)  /*  bit 1 mask. */
#define FET_UCF1_bp  1  /*  bit 1 position. */


/* FUSE - Fuses and Lockbits */
/* NVM_FUSES.FUSEBYTE1  bit masks and bit positions */
#define NVM_FUSES_WDPER_gm  0x0F  /* Watchdog Timeout Period group mask. */
#define NVM_FUSES_WDPER_gp  0  /* Watchdog Timeout Period group position. */
#define NVM_FUSES_WDPER0_bm  (1<<0)  /* Watchdog Timeout Period bit 0 mask. */
#define NVM_FUSES_WDPER0_bp  0  /* Watchdog Timeout Period bit 0 position. */
#define NVM_FUSES_WDPER1_bm  (1<<1)  /* Watchdog Timeout Period bit 1 mask. */
#define NVM_FUSES_WDPER1_bp  1  /* Watchdog Timeout Period bit 1 position. */
#define NVM_FUSES_WDPER2_bm  (1<<2)  /* Watchdog Timeout Period bit 2 mask. */
#define NVM_FUSES_WDPER2_bp  2  /* Watchdog Timeout Period bit 2 position. */
#define NVM_FUSES_WDPER3_bm  (1<<3)  /* Watchdog Timeout Period bit 3 mask. */
#define NVM_FUSES_WDPER3_bp  3  /* Watchdog Timeout Period bit 3 position. */
#define NVM_FUSES_WDWPER_gm  0xF0  /* Watchdog Window Timeout Period group mask. */
#define NVM_FUSES_WDWPER_gp  4  /* Watchdog Window Timeout Period group position. */
#define NVM_FUSES_WDWPER0_bm  (1<<4)  /* Watchdog Window Timeout Period bit 0 mask. */
#define NVM_FUSES_WDWPER0_bp  4  /* Watchdog Window Timeout Period bit 0 position. */
#define NVM_FUSES_WDWPER1_bm  (1<<5)  /* Watchdog Window Timeout Period bit 1 mask. */
#define NVM_FUSES_WDWPER1_bp  5  /* Watchdog Window Timeout Period bit 1 position. */
#define NVM_FUSES_WDWPER2_bm  (1<<6)  /* Watchdog Window Timeout Period bit 2 mask. */
#define NVM_FUSES_WDWPER2_bp  6  /* Watchdog Window Timeout Period bit 2 position. */
#define NVM_FUSES_WDWPER3_bm  (1<<7)  /* Watchdog Window Timeout Period bit 3 mask. */
#define NVM_FUSES_WDWPER3_bp  7  /* Watchdog Window Timeout Period bit 3 position. */

/* NVM_FUSES.FUSEBYTE2  bit masks and bit positions */
#define NVM_FUSES_BOOTRST_bm  0x40  /* Boot Loader Section Reset Vector bit mask. */
#define NVM_FUSES_BOOTRST_bp  6  /* Boot Loader Section Reset Vector bit position. */

/* NVM_FUSES.FUSEBYTE4  bit masks and bit positions */
#define NVM_FUSES_WDLOCK_bm  0x02  /* Watchdog Timer Lock bit mask. */
#define NVM_FUSES_WDLOCK_bp  1  /* Watchdog Timer Lock bit position. */
#define NVM_FUSES_STARTUPTIME_gm  0x0C  /* Start-up Time group mask. */
#define NVM_FUSES_STARTUPTIME_gp  2  /* Start-up Time group position. */
#define NVM_FUSES_STARTUPTIME0_bm  (1<<2)  /* Start-up Time bit 0 mask. */
#define NVM_FUSES_STARTUPTIME0_bp  2  /* Start-up Time bit 0 position. */
#define NVM_FUSES_STARTUPTIME1_bm  (1<<3)  /* Start-up Time bit 1 mask. */
#define NVM_FUSES_STARTUPTIME1_bp  3  /* Start-up Time bit 1 position. */
#define NVM_FUSES_RSTDISBL_bm  0x10  /* External Reset Disable bit mask. */
#define NVM_FUSES_RSTDISBL_bp  4  /* External Reset Disable bit position. */

/* NVM_FUSES.FUSEBYTE5  bit masks and bit positions */
#define NVM_FUSES_EESAVE_bm  0x08  /* Preserve EEPROM Through Chip Erase bit mask. */
#define NVM_FUSES_EESAVE_bp  3  /* Preserve EEPROM Through Chip Erase bit position. */
#define NVM_FUSES_AUTOLD_bm  0x20  /* Autoload select value bit mask. */
#define NVM_FUSES_AUTOLD_bp  5  /* Autoload select value bit position. */





/* LOCKBIT - Fuses and Lockbits */
/* NVM_LOCKBITS.LOCKBITS  bit masks and bit positions */
#define NVM_LOCKBITS_LB_gm  0x03  /* Lock Bits group mask. */
#define NVM_LOCKBITS_LB_gp  0  /* Lock Bits group position. */
#define NVM_LOCKBITS_LB0_bm  (1<<0)  /* Lock Bits bit 0 mask. */
#define NVM_LOCKBITS_LB0_bp  0  /* Lock Bits bit 0 position. */
#define NVM_LOCKBITS_LB1_bm  (1<<1)  /* Lock Bits bit 1 mask. */
#define NVM_LOCKBITS_LB1_bp  1  /* Lock Bits bit 1 position. */
#define NVM_LOCKBITS_BLBAT_gm  0x0C  /* Boot Lock Bits - Application Table group mask. */
#define NVM_LOCKBITS_BLBAT_gp  2  /* Boot Lock Bits - Application Table group position. */
#define NVM_LOCKBITS_BLBAT0_bm  (1<<2)  /* Boot Lock Bits - Application Table bit 0 mask. */
#define NVM_LOCKBITS_BLBAT0_bp  2  /* Boot Lock Bits - Application Table bit 0 position. */
#define NVM_LOCKBITS_BLBAT1_bm  (1<<3)  /* Boot Lock Bits - Application Table bit 1 mask. */
#define NVM_LOCKBITS_BLBAT1_bp  3  /* Boot Lock Bits - Application Table bit 1 position. */
#define NVM_LOCKBITS_BLBA_gm  0x30  /* Boot Lock Bits - Application Section group mask. */
#define NVM_LOCKBITS_BLBA_gp  4  /* Boot Lock Bits - Application Section group position. */
#define NVM_LOCKBITS_BLBA0_bm  (1<<4)  /* Boot Lock Bits - Application Section bit 0 mask. */
#define NVM_LOCKBITS_BLBA0_bp  4  /* Boot Lock Bits - Application Section bit 0 position. */
#define NVM_LOCKBITS_BLBA1_bm  (1<<5)  /* Boot Lock Bits - Application Section bit 1 mask. */
#define NVM_LOCKBITS_BLBA1_bp  5  /* Boot Lock Bits - Application Section bit 1 position. */
#define NVM_LOCKBITS_BLBB_gm  0xC0  /* Boot Lock Bits - Boot Section group mask. */
#define NVM_LOCKBITS_BLBB_gp  6  /* Boot Lock Bits - Boot Section group position. */
#define NVM_LOCKBITS_BLBB0_bm  (1<<6)  /* Boot Lock Bits - Boot Section bit 0 mask. */
#define NVM_LOCKBITS_BLBB0_bp  6  /* Boot Lock Bits - Boot Section bit 0 position. */
#define NVM_LOCKBITS_BLBB1_bm  (1<<7)  /* Boot Lock Bits - Boot Section bit 1 mask. */
#define NVM_LOCKBITS_BLBB1_bp  7  /* Boot Lock Bits - Boot Section bit 1 position. */











/* NVM - Non Volatile Memory Controller */
/* NVM.CMD  bit masks and bit positions */
#define NVM_CMD_gm  0x7F  /* Command group mask. */
#define NVM_CMD_gp  0  /* Command group position. */
#define NVM_CMD0_bm  (1<<0)  /* Command bit 0 mask. */
#define NVM_CMD0_bp  0  /* Command bit 0 position. */
#define NVM_CMD1_bm  (1<<1)  /* Command bit 1 mask. */
#define NVM_CMD1_bp  1  /* Command bit 1 position. */
#define NVM_CMD2_bm  (1<<2)  /* Command bit 2 mask. */
#define NVM_CMD2_bp  2  /* Command bit 2 position. */
#define NVM_CMD3_bm  (1<<3)  /* Command bit 3 mask. */
#define NVM_CMD3_bp  3  /* Command bit 3 position. */
#define NVM_CMD4_bm  (1<<4)  /* Command bit 4 mask. */
#define NVM_CMD4_bp  4  /* Command bit 4 position. */
#define NVM_CMD5_bm  (1<<5)  /* Command bit 5 mask. */
#define NVM_CMD5_bp  5  /* Command bit 5 position. */
#define NVM_CMD6_bm  (1<<6)  /* Command bit 6 mask. */
#define NVM_CMD6_bp  6  /* Command bit 6 position. */

/* NVM.CTRLA  bit masks and bit positions */
#define NVM_CMDEX_bm  0x01  /* Command Execute bit mask. */
#define NVM_CMDEX_bp  0  /* Command Execute bit position. */

