gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* USART.CTRLB  bit masks and bit positions */
#define USART_TXB8_bm  0x01  /* Transmit bit 8 bit mask. */
#define USART_TXB8_bp  0  /* Transmit bit 8 bit position. */
#define USART_MPCM_bm  0x02  /* Multi-processor Communication Mode bit mask. */
#define USART_MPCM_bp  1  /* Multi-processor Communication Mode bit position. */
#define USART_CLK2X_bm  0x04  /* Double transmission speed bit mask. */
#define USART_CLK2X_bp  2  /* Double transmission speed bit position. */
#define USART_TXEN_bm  0x08  /* Transmitter Enable bit mask. */
#define USART_TXEN_bp  3  /* Transmitter Enable bit position. */
#define USART_RXEN_bm  0x10  /* Receiver Enable bit mask. */
#define USART_RXEN_bp  4  /* Receiver Enable bit position. */

/* USART.CTRLC  bit masks and bit positions */
#define USART_CHSIZE_gm  0x07  /* Character Size group mask. */
#define USART_CHSIZE_gp  0  /* Character Size group position. */
#define USART_CHSIZE0_bm  (1<<0)  /* Character Size bit 0 mask. */
#define USART_CHSIZE0_bp  0  /* Character Size bit 0 position. */
#define USART_CHSIZE1_bm  (1<<1)  /* Character Size bit 1 mask. */
#define USART_CHSIZE1_bp  1  /* Character Size bit 1 position. */
#define USART_CHSIZE2_bm  (1<<2)  /* Character Size bit 2 mask. */
#define USART_CHSIZE2_bp  2  /* Character Size bit 2 position. */
#define USART_SBMODE_bm  0x08  /* Stop Bit Mode bit mask. */
#define USART_SBMODE_bp  3  /* Stop Bit Mode bit position. */
#define USART_PMODE_gm  0x30  /* Parity Mode group mask. */
#define USART_PMODE_gp  4  /* Parity Mode group position. */
#define USART_PMODE0_bm  (1<<4)  /* Parity Mode bit 0 mask. */
#define USART_PMODE0_bp  4  /* Parity Mode bit 0 position. */
#define USART_PMODE1_bm  (1<<5)  /* Parity Mode bit 1 mask. */
#define USART_PMODE1_bp  5  /* Parity Mode bit 1 position. */
#define USART_CMODE_gm  0xC0  /* Communication Mode group mask. */
#define USART_CMODE_gp  6  /* Communication Mode group position. */
#define USART_CMODE0_bm  (1<<6)  /* Communication Mode bit 0 mask. */
#define USART_CMODE0_bp  6  /* Communication Mode bit 0 position. */
#define USART_CMODE1_bm  (1<<7)  /* Communication Mode bit 1 mask. */
#define USART_CMODE1_bp  7  /* Communication Mode bit 1 position. */

/* USART.BAUDCTRLA  bit masks and bit positions */
#define USART_BSEL_gm  0xFF  /* Baud Rate Selection Bits [7:0] group mask. */
#define USART_BSEL_gp  0  /* Baud Rate Selection Bits [7:0] group position. */
#define USART_BSEL0_bm  (1<<0)  /* Baud Rate Selection Bits [7:0] bit 0 mask. */
#define USART_BSEL0_bp  0  /* Baud Rate Selection Bits [7:0] bit 0 position. */
#define USART_BSEL1_bm  (1<<1)  /* Baud Rate Selection Bits [7:0] bit 1 mask. */
#define USART_BSEL1_bp  1  /* Baud Rate Selection Bits [7:0] bit 1 position. */
#define USART_BSEL2_bm  (1<<2)  /* Baud Rate Selection Bits [7:0] bit 2 mask. */
#define USART_BSEL2_bp  2  /* Baud Rate Selection Bits [7:0] bit 2 position. */
#define USART_BSEL3_bm  (1<<3)  /* Baud Rate Selection Bits [7:0] bit 3 mask. */
#define USART_BSEL3_bp  3  /* Baud Rate Selection Bits [7:0] bit 3 position. */
#define USART_BSEL4_bm  (1<<4)  /* Baud Rate Selection Bits [7:0] bit 4 mask. */
#define USART_BSEL4_bp  4  /* Baud Rate Selection Bits [7:0] bit 4 position. */
#define USART_BSEL5_bm  (1<<5)  /* Baud Rate Selection Bits [7:0] bit 5 mask. */
#define USART_BSEL5_bp  5  /* Baud Rate Selection Bits [7:0] bit 5 position. */
#define USART_BSEL6_bm  (1<<6)  /* Baud Rate Selection Bits [7:0] bit 6 mask. */
#define USART_BSEL6_bp  6  /* Baud Rate Selection Bits [7:0] bit 6 position. */
#define USART_BSEL7_bm  (1<<7)  /* Baud Rate Selection Bits [7:0] bit 7 mask. */
#define USART_BSEL7_bp  7  /* Baud Rate Selection Bits [7:0] bit 7 position. */

/* USART.BAUDCTRLB  bit masks and bit positions */
/* USART_BSEL  is already defined. */
#define USART_BSCALE_gm  0xF0  /* Baud Rate Scale group mask. */
#define USART_BSCALE_gp  4  /* Baud Rate Scale group position. */
#define USART_BSCALE0_bm  (1<<4)  /* Baud Rate Scale bit 0 mask. */
#define USART_BSCALE0_bp  4  /* Baud Rate Scale bit 0 position. */
#define USART_BSCALE1_bm  (1<<5)  /* Baud Rate Scale bit 1 mask. */
#define USART_BSCALE1_bp  5  /* Baud Rate Scale bit 1 position. */
#define USART_BSCALE2_bm  (1<<6)  /* Baud Rate Scale bit 2 mask. */
#define USART_BSCALE2_bp  6  /* Baud Rate Scale bit 2 position. */
#define USART_BSCALE3_bm  (1<<7)  /* Baud Rate Scale bit 3 mask. */
#define USART_BSCALE3_bp  7  /* Baud Rate Scale bit 3 position. */

/* VADC - Voltage ADC */
/* VADC.CTRLA  bit masks and bit positions */
#define VADC_STARTCONV_bm  0x01  /* Start Conversion bit mask. */
#define VADC_STARTCONV_bp  0  /* Start Conversion bit position. */

/* VADC.CTRLB  bit masks and bit positions */
#define VADC_DECIR_gm  0x03  /* Decimation Ratio group mask. */
#define VADC_DECIR_gp  0  /* Decimation Ratio group position. */
#define VADC_DECIR0_bm  (1<<0)  /* Decimation Ratio bit 0 mask. */
#define VADC_DECIR0_bp  0  /* Decimation Ratio bit 0 position. */
#define VADC_DECIR1_bm  (1<<1)  /* Decimation Ratio bit 1 mask. */
#define VADC_DECIR1_bp  1  /* Decimation Ratio bit 1 position. */
#define VADC_CHOPEN_bm  0x04  /* Chopping Enable bit mask. */
#define VADC_CHOPEN_bp  2  /* Chopping Enable bit position. */
#define VADC_CILVL_gm  0x18  /* Conversion Complete Interrupt Level group mask. */
#define VADC_CILVL_gp  3  /* Conversion Complete Interrupt Level group position. */
#define VADC_CILVL0_bm  (1<<3)  /* Conversion Complete Interrupt Level bit 0 mask. */
#define VADC_CILVL0_bp  3  /* Conversion Complete Interrupt Level bit 0 position. */
#define VADC_CILVL1_bm  (1<<4)  /* Conversion Complete Interrupt Level bit 1 mask. */
#define VADC_CILVL1_bp  4  /* Conversion Complete Interrupt Level bit 1 position. */
#define VADC_PILVL_gm  0x60  /* Protection Scan Complete Interrupt Level group mask. */
#define VADC_PILVL_gp  5  /* Protection Scan Complete Interrupt Level group position. */
#define VADC_PILVL0_bm  (1<<5)  /* Protection Scan Complete Interrupt Level bit 0 mask. */
#define VADC_PILVL0_bp  5  /* Protection Scan Complete Interrupt Level bit 0 position. */
#define VADC_PILVL1_bm  (1<<6)  /* Protection Scan Complete Interrupt Level bit 1 mask. */
#define VADC_PILVL1_bp  6  /* Protection Scan Complete Interrupt Level bit 1 position. */

/* VADC.DIAGNOSIS  bit masks and bit positions */
#define VADC_NVDIAG_gm  0x03  /* NV Diagnostic Configuration group mask. */
#define VADC_NVDIAG_gp  0  /* NV Diagnostic Configuration group position. */
#define VADC_NVDIAG0_bm  (1<<0)  /* NV Diagnostic Configuration bit 0 mask. */
#define VADC_NVDIAG0_bp  0  /* NV Diagnostic Configuration bit 0 position. */
#define VADC_NVDIAG1_bm  (1<<1)  /* NV Diagnostic Configuration bit 1 mask. */
#define VADC_NVDIAG1_bp  1  /* NV Diagnostic Configuration bit 1 position. */
#define VADC_PVDIAG_gm  0x0C  /* PV Diagnostic Configuration group mask. */
#define VADC_PVDIAG_gp  2  /* PV Diagnostic Configuration group position. */
#define VADC_PVDIAG0_bm  (1<<2)  /* PV Diagnostic Configuration bit 0 mask. */
#define VADC_PVDIAG0_bp  2  /* PV Diagnostic Configuration bit 0 position. */
#define VADC_PVDIAG1_bm  (1<<3)  /* PV Diagnostic Configuration bit 1 mask. */
#define VADC_PVDIAG1_bp  3  /* PV Diagnostic Configuration bit 1 position. */

/* VADC.SCANSETUP  bit masks and bit positions */
#define VADC_CHANNELSEL_gm  0x0F  /* Channel Select group mask. */
#define VADC_CHANNELSEL_gp  0  /* Channel Select group position. */
#define VADC_CHANNELSEL0_bm  (1<<0)  /* Channel Select bit 0 mask. */
#define VADC_CHANNELSEL0_bp  0  /* Channel Select bit 0 position. */
#define VADC_CHANNELSEL1_bm  (1<<1)  /* Channel Select bit 1 mask. */
#define VADC_CHANNELSEL1_bp  1  /* Channel Select bit 1 position. */
#define VADC_CHANNELSEL2_bm  (1<<2)  /* Channel Select bit 2 mask. */
#define VADC_CHANNELSEL2_bp  2  /* Channel Select bit 2 position. */
#define VADC_CHANNELSEL3_bm  (1<<3)  /* Channel Select bit 3 mask. */
#define VADC_CHANNELSEL3_bp  3  /* Channel Select bit 3 position. */

/* VADC.PROTSETUPA  bit masks and bit positions */
/* VADC_CHANNELSEL  is already defined. */

