gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* VADC.PROTSETUPB  bit masks and bit positions */
#define VADC_TIMING_gm  0x07  /* Protection Timing group mask. */
#define VADC_TIMING_gp  0  /* Protection Timing group position. */
#define VADC_TIMING0_bm  (1<<0)  /* Protection Timing bit 0 mask. */
#define VADC_TIMING0_bp  0  /* Protection Timing bit 0 position. */
#define VADC_TIMING1_bm  (1<<1)  /* Protection Timing bit 1 mask. */
#define VADC_TIMING1_bp  1  /* Protection Timing bit 1 position. */
#define VADC_TIMING2_bm  (1<<2)  /* Protection Timing bit 2 mask. */
#define VADC_TIMING2_bp  2  /* Protection Timing bit 2 position. */
#define VADC_PROTCNT_gm  0x60  /* Protection Count Limit group mask. */
#define VADC_PROTCNT_gp  5  /* Protection Count Limit group position. */
#define VADC_PROTCNT0_bm  (1<<5)  /* Protection Count Limit bit 0 mask. */
#define VADC_PROTCNT0_bp  5  /* Protection Count Limit bit 0 position. */
#define VADC_PROTCNT1_bm  (1<<6)  /* Protection Count Limit bit 1 mask. */
#define VADC_PROTCNT1_bp  6  /* Protection Count Limit bit 1 position. */

/* VADC.STATUS  bit masks and bit positions */
#define VADC_CONVIF_bm  0x01  /* Conversion Complete Interrupt Flag bit mask. */
#define VADC_CONVIF_bp  0  /* Conversion Complete Interrupt Flag bit position. */
#define VADC_ABORTED_bm  0x02  /* Conversion Aborted Flag bit mask. */
#define VADC_ABORTED_bp  1  /* Conversion Aborted Flag bit position. */
#define VADC_PROTSF_bm  0x04  /* Protection Scan Started Flag bit mask. */
#define VADC_PROTSF_bp  2  /* Protection Scan Started Flag bit position. */
#define VADC_PROTFIF_bm  0x08  /* Protection Scan Finished Interrupt Flag bit mask. */
#define VADC_PROTFIF_bp  3  /* Protection Scan Finished Interrupt Flag bit position. */














/* VPORT - Virtual Ports */
/* VPORT.DIR  bit masks and bit positions */
#define VPORT_DIR_gm  0xFF  /* Data Direction Value group mask. */
#define VPORT_DIR_gp  0  /* Data Direction Value group position. */
#define VPORT_DIR0_bm  (1<<0)  /* Data Direction Value bit 0 mask. */
#define VPORT_DIR0_bp  0  /* Data Direction Value bit 0 position. */
#define VPORT_DIR1_bm  (1<<1)  /* Data Direction Value bit 1 mask. */
#define VPORT_DIR1_bp  1  /* Data Direction Value bit 1 position. */
#define VPORT_DIR2_bm  (1<<2)  /* Data Direction Value bit 2 mask. */
#define VPORT_DIR2_bp  2  /* Data Direction Value bit 2 position. */
#define VPORT_DIR3_bm  (1<<3)  /* Data Direction Value bit 3 mask. */
#define VPORT_DIR3_bp  3  /* Data Direction Value bit 3 position. */
#define VPORT_DIR4_bm  (1<<4)  /* Data Direction Value bit 4 mask. */
#define VPORT_DIR4_bp  4  /* Data Direction Value bit 4 position. */
#define VPORT_DIR5_bm  (1<<5)  /* Data Direction Value bit 5 mask. */
#define VPORT_DIR5_bp  5  /* Data Direction Value bit 5 position. */
#define VPORT_DIR6_bm  (1<<6)  /* Data Direction Value bit 6 mask. */
#define VPORT_DIR6_bp  6  /* Data Direction Value bit 6 position. */
#define VPORT_DIR7_bm  (1<<7)  /* Data Direction Value bit 7 mask. */
#define VPORT_DIR7_bp  7  /* Data Direction Value bit 7 position. */

/* VPORT.OUT  bit masks and bit positions */
#define VPORT_OUT_gm  0xFF  /* Output Value group mask. */
#define VPORT_OUT_gp  0  /* Output Value group position. */
#define VPORT_OUT0_bm  (1<<0)  /* Output Value bit 0 mask. */
#define VPORT_OUT0_bp  0  /* Output Value bit 0 position. */
#define VPORT_OUT1_bm  (1<<1)  /* Output Value bit 1 mask. */
#define VPORT_OUT1_bp  1  /* Output Value bit 1 position. */
#define VPORT_OUT2_bm  (1<<2)  /* Output Value bit 2 mask. */
#define VPORT_OUT2_bp  2  /* Output Value bit 2 position. */
#define VPORT_OUT3_bm  (1<<3)  /* Output Value bit 3 mask. */
#define VPORT_OUT3_bp  3  /* Output Value bit 3 position. */
#define VPORT_OUT4_bm  (1<<4)  /* Output Value bit 4 mask. */
#define VPORT_OUT4_bp  4  /* Output Value bit 4 position. */
#define VPORT_OUT5_bm  (1<<5)  /* Output Value bit 5 mask. */
#define VPORT_OUT5_bp  5  /* Output Value bit 5 position. */
#define VPORT_OUT6_bm  (1<<6)  /* Output Value bit 6 mask. */
#define VPORT_OUT6_bp  6  /* Output Value bit 6 position. */
#define VPORT_OUT7_bm  (1<<7)  /* Output Value bit 7 mask. */
#define VPORT_OUT7_bp  7  /* Output Value bit 7 position. */

/* VPORT.IN  bit masks and bit positions */
#define VPORT_IN_gm  0xFF  /* Input Value group mask. */
#define VPORT_IN_gp  0  /* Input Value group position. */
#define VPORT_IN0_bm  (1<<0)  /* Input Value bit 0 mask. */
#define VPORT_IN0_bp  0  /* Input Value bit 0 position. */
#define VPORT_IN1_bm  (1<<1)  /* Input Value bit 1 mask. */
#define VPORT_IN1_bp  1  /* Input Value bit 1 position. */
#define VPORT_IN2_bm  (1<<2)  /* Input Value bit 2 mask. */
#define VPORT_IN2_bp  2  /* Input Value bit 2 position. */
#define VPORT_IN3_bm  (1<<3)  /* Input Value bit 3 mask. */
#define VPORT_IN3_bp  3  /* Input Value bit 3 position. */
#define VPORT_IN4_bm  (1<<4)  /* Input Value bit 4 mask. */
#define VPORT_IN4_bp  4  /* Input Value bit 4 position. */
#define VPORT_IN5_bm  (1<<5)  /* Input Value bit 5 mask. */
#define VPORT_IN5_bp  5  /* Input Value bit 5 position. */
#define VPORT_IN6_bm  (1<<6)  /* Input Value bit 6 mask. */
#define VPORT_IN6_bp  6  /* Input Value bit 6 position. */
#define VPORT_IN7_bm  (1<<7)  /* Input Value bit 7 mask. */
#define VPORT_IN7_bp  7  /* Input Value bit 7 position. */

/* VPORT.INTFLAGS  bit masks and bit positions */
#define VPORT_INT0IF_bm  0x01  /* Port Interrupt 0 Flag bit mask. */
#define VPORT_INT0IF_bp  0  /* Port Interrupt 0 Flag bit position. */
#define VPORT_INT1IF_bm  0x02  /* Port Interrupt 1 Flag bit mask. */
#define VPORT_INT1IF_bp  1  /* Port Interrupt 1 Flag bit position. */

/* VREF - Voltage Reference */
/* VREF.CTRLA  bit masks and bit positions */
#define VREF_SDINTLVL_gm  0x03  /* Short Detector Interrupt Level group mask. */
#define VREF_SDINTLVL_gp  0  /* Short Detector Interrupt Level group position. */
#define VREF_SDINTLVL0_bm  (1<<0)  /* Short Detector Interrupt Level bit 0 mask. */
#define VREF_SDINTLVL0_bp  0  /* Short Detector Interrupt Level bit 0 position. */
#define VREF_SDINTLVL1_bm  (1<<1)  /* Short Detector Interrupt Level bit 1 mask. */
#define VREF_SDINTLVL1_bp  1  /* Short Detector Interrupt Level bit 1 position. */
#define VREF_SDE_bm  0x04  /* Short Detector Enabled bit mask. */
#define VREF_SDE_bp  2  /* Short Detector Enabled bit position. */

/* VREF.STATUS  bit masks and bit positions */
#define VREF_SDIF_bm  0x01  /* Short Detector Interrupt Flag bit mask. */
#define VREF_SDIF_bp  0  /* Short Detector Interrupt Flag bit position. */
#define VREF_SDS_bm  0x02  /* Short Detector Status bit mask. */
#define VREF_SDS_bp  1  /* Short Detector Status bit position. */
#define VREF_VREFRDY_bm  0x04  /* Reference Voltage Ready bit mask. */
#define VREF_VREFRDY_bp  2  /* Reference Voltage Ready bit position. */

