gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iox32x1.h
/* BCD interrupt vectors */
#define BCD_BCD_vect_num  17
#define BCD_BCD_vect      _VECTOR(17)  /* Bus Connect/Disconnect Interrupt */

/* USARTC interrupt vectors */
#define USARTC_RXC_vect_num  18
#define USARTC_RXC_vect      _VECTOR(18)  /* Reception Complete Interrupt */
#define USARTC_DRE_vect_num  19
#define USARTC_DRE_vect      _VECTOR(19)  /* Data Register Empty Interrupt */
#define USARTC_TXC_vect_num  20
#define USARTC_TXC_vect      _VECTOR(20)  /* Transmission Complete Interrupt */

/* TWIC interrupt vectors */
#define TWIC_TWIS_vect_num  21
#define TWIC_TWIS_vect      _VECTOR(21)  /* TWI Slave Interrupt */

/* VADC interrupt vectors */
#define VADC_VADCCF_vect_num  23
#define VADC_VADCCF_vect      _VECTOR(23)  /* VADC conversion finished */
#define VADC_VADCPROTF_vect_num  24
#define VADC_VADCPROTF_vect      _VECTOR(24)  /* VADC protection scan finished */

/* CADC interrupt vectors */
#define CADC_CADCCF_vect_num  25
#define CADC_CADCCF_vect      _VECTOR(25)  /* CADC conversion finish interrupt */
#define CADC_CADCSM_vect_num  26
#define CADC_CADCSM_vect      _VECTOR(26)  /* CADC sample mode interrupt */

/* NVM interrupt vectors */
#define NVM_EE_vect_num  27
#define NVM_EE_vect      _VECTOR(27)  /* EE Interrupt */
#define NVM_SPM_vect_num  28
#define NVM_SPM_vect      _VECTOR(28)  /* SPM Interrupt */

#define _VECTOR_SIZE 4 /* Size of individual vector. */
#define _VECTORS_SIZE (29 * _VECTOR_SIZE)


/* ========== Constants ========== */

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define PROGMEM_START     (0x0000)
#  define PROGMEM_SIZE      (36864)
#else
#  define PROGMEM_START     (0x0000U)
#  define PROGMEM_SIZE      (36864U)
#endif
#define PROGMEM_END       (PROGMEM_START + PROGMEM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define APP_SECTION_START     (0x0000)
#  define APP_SECTION_SIZE      (32768)
#  define APP_SECTION_PAGE_SIZE (256)
#else
#  define APP_SECTION_START     (0x0000U)
#  define APP_SECTION_SIZE      (32768U)
#  define APP_SECTION_PAGE_SIZE (256U)
#endif
#define APP_SECTION_END       (APP_SECTION_START + APP_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define APPTABLE_SECTION_START     (0x7000)
#  define APPTABLE_SECTION_SIZE      (4096)
#  define APPTABLE_SECTION_PAGE_SIZE (256)
#else
#  define APPTABLE_SECTION_START     (0x7000U)
#  define APPTABLE_SECTION_SIZE      (4096U)
#  define APPTABLE_SECTION_PAGE_SIZE (256U)
#endif
#define APPTABLE_SECTION_END       (APPTABLE_SECTION_START + APPTABLE_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define BOOT_SECTION_START     (0x8000)
#  define BOOT_SECTION_SIZE      (4096)
#  define BOOT_SECTION_PAGE_SIZE (256)
#else
#  define BOOT_SECTION_START     (0x8000U)
#  define BOOT_SECTION_SIZE      (4096U)
#  define BOOT_SECTION_PAGE_SIZE (256U)
#endif
#define BOOT_SECTION_END       (BOOT_SECTION_START + BOOT_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define DATAMEM_START     (0x0000)
#  define DATAMEM_SIZE      (10240)
#else
#  define DATAMEM_START     (0x0000U)
#  define DATAMEM_SIZE      (10240U)
#endif
#define DATAMEM_END       (DATAMEM_START + DATAMEM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define IO_START     (0x0000)
#  define IO_SIZE      (4096)
#  define IO_PAGE_SIZE (0)
#else
#  define IO_START     (0x0000U)
#  define IO_SIZE      (4096U)
#  define IO_PAGE_SIZE (0U)
#endif
#define IO_END       (IO_START + IO_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define MAPPED_EEPROM_START     (0x1000)
#  define MAPPED_EEPROM_SIZE      (1024)
#  define MAPPED_EEPROM_PAGE_SIZE (0)
#else
#  define MAPPED_EEPROM_START     (0x1000U)
#  define MAPPED_EEPROM_SIZE      (1024U)
#  define MAPPED_EEPROM_PAGE_SIZE (0U)
#endif
#define MAPPED_EEPROM_END       (MAPPED_EEPROM_START + MAPPED_EEPROM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define INTERNAL_SRAM_START     (0x2000)
#  define INTERNAL_SRAM_SIZE      (2048)
#  define INTERNAL_SRAM_PAGE_SIZE (0)
#else
#  define INTERNAL_SRAM_START     (0x2000U)
#  define INTERNAL_SRAM_SIZE      (2048U)
#  define INTERNAL_SRAM_PAGE_SIZE (0U)
#endif
#define INTERNAL_SRAM_END       (INTERNAL_SRAM_START + INTERNAL_SRAM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define EEPROM_START     (0x0000)
#  define EEPROM_SIZE      (1024)
#  define EEPROM_PAGE_SIZE (32)
#else
#  define EEPROM_START     (0x0000U)
#  define EEPROM_SIZE      (1024U)
#  define EEPROM_PAGE_SIZE (32U)
#endif
#define EEPROM_END       (EEPROM_START + EEPROM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SIGNATURES_START     (0x0000)
#  define SIGNATURES_SIZE      (3)
#  define SIGNATURES_PAGE_SIZE (0)
#else
#  define SIGNATURES_START     (0x0000U)
#  define SIGNATURES_SIZE      (3U)
#  define SIGNATURES_PAGE_SIZE (0U)
#endif
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define FUSES_START     (0x0000)
#  define FUSES_SIZE      (6)
#  define FUSES_PAGE_SIZE (0)
#else
#  define FUSES_START     (0x0000U)
#  define FUSES_SIZE      (6U)
#  define FUSES_PAGE_SIZE (0U)
#endif
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define LOCKBITS_START     (0x0000)
#  define LOCKBITS_SIZE      (1)
#  define LOCKBITS_PAGE_SIZE (0)
#else
#  define LOCKBITS_START     (0x0000U)
#  define LOCKBITS_SIZE      (1U)
#  define LOCKBITS_PAGE_SIZE (0U)
#endif
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define USER_SIGNATURES_START     (0x0000)
#  define USER_SIGNATURES_SIZE      (256)
#  define USER_SIGNATURES_PAGE_SIZE (256)
#else
#  define USER_SIGNATURES_START     (0x0000U)
#  define USER_SIGNATURES_SIZE      (256U)
#  define USER_SIGNATURES_PAGE_SIZE (256U)
#endif
#define USER_SIGNATURES_END       (USER_SIGNATURES_START + USER_SIGNATURES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define PROD_SIGNATURES_START     (0x0000)
#  define PROD_SIGNATURES_SIZE      (52)
#  define PROD_SIGNATURES_PAGE_SIZE (256)
#else
#  define PROD_SIGNATURES_START     (0x0000U)
#  define PROD_SIGNATURES_SIZE      (52U)
#  define PROD_SIGNATURES_PAGE_SIZE (256U)
#endif
#define PROD_SIGNATURES_END       (PROD_SIGNATURES_START + PROD_SIGNATURES_SIZE - 1)

#define FLASHSTART   PROGMEM_START
#define FLASHEND     PROGMEM_END
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SPM_PAGESIZE 256
#else
#  define SPM_PAGESIZE 256U
#endif
#define RAMSTART     INTERNAL_SRAM_START
#define RAMSIZE      INTERNAL_SRAM_SIZE
#define RAMEND       INTERNAL_SRAM_END
#define E2END        EEPROM_END
#define E2PAGESIZE   EEPROM_PAGE_SIZE


/* ========== Fuses ========== */
#define FUSE_MEMORY_SIZE 6

/* Fuse Byte 0 (FUSEBYTE0) */
#define FUSE0_DEFAULT  (0xFF)
#define FUSE_FUSEBYTE0_DEFAULT  (0xFF)

